<?php require_once('php/_navchishin.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>光量子计算机时代的来临?</title>
<meta name="description" content="光取代电, 听起来是很合理. 在长途通讯上, 光纤取代了电缆. 但我觉得光量子计算应该先定位在像D-Wave那样的产品. 若是光量子计算机定位在一般用途的计算机, 那可是前途茫茫苦海无边.">
<?php EchoInsideHead(); ?>
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _ChishinLayoutTopLeft(); ?>

<div>
<h1>光量子计算机时代的来临?</h1>
<h4>2017年5月17日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>光取代电, 听起来是很合理. 在长途通讯上, 光纤取代了电缆. 20年前, 当我听说用新的DWDM技术能让光纤的通讯容量增加100倍, 兴奋不已. 节衣缩食用了几百块钱美金买这方面的书. 花了6个月的时间每天上Stanford大学图书馆, 
研究光通讯这方面的会议资料. 可是这一次光量子计算机时代的来临, 心里却是疑虑重重. 
<br />大约5年前, 潘建伟用实验证明了长距离量子纠缠原理, 我觉得十分新奇. 去年8月中国发射了世界上第一颗量子卫星, 他利用量子纠缠原理实现了卫星和地面之间无法破解的保密通信.
因为只要外界非法侵入这个通讯系统, 就会改变量子纠缠状态, 系统就会察觉同时立刻发出新的密码, 使传送的讯息无法破解. 这个了不起的成就有广泛的应用, 它可以用在银行转帐, 军事, 国防, 外交以及种种商业机密上面. 
<br />一年多前中国用量子纠缠原理探测出一百多公里外的隐形战机, 发射和接受某类量子态的光源, 同时过滤掉不是这种量子态的背景信号. 这也是一个很好的应用. 
<br />以上两种都是靠单一讯息源的量子信息传输, 实现起来硬体比较简单. 而且这些都是市场上没有的东西, 只要能做出来就有立即的需要.
光量子计算机就不一样, 它不会比今天的CPU芯片小, 或是省电, 或是便宜, 或是更可靠, 或是更容易集成到整个系统里. 我们永远都看不见光量子计算机用在手机, 平板电脑, 笔记本电脑或是个人电脑里面.
它唯一的长处就是计算速度快, 而且必须要比20年后CPU芯片速度还要快, 否则还没做出来或是做出来没多久市场就不见了. 
<br />早期的计算机没有竞争对手, 只要一出来新的, 就有很大的市场, 所以不需要政府出什么研发经费, 企业就可以负担, 而且赚取了巨额的利润. 光量子计算机 一开始就有很高的技术门槛, 很高的研发费用, 利润可是遥遥无期. 
<br />光量子计算机最大的问题就是无法用集成线路的方式实现出来, 一个高档的计算机里面有许许多多的逻辑功能块, 有硬件加速器做科学计算, 必须要用浮点运算模块, 这些几100000门的功能模块如何用一堆金刚石激光实现和连结?
计算机还需要很多寄存器和记忆体, 这些随着计算机的速度加快而变大, 它们是用光的形式还是用电的形式实现的? 若是用电的形式, 每一次计算就要做一次光电和电光的转换, 这些都会把整个运算速度降下来.
光就像飞机, 电就像火车, 每一步计算若是进来的数据, 算出的结果都是用电的形式储存, 就好像飞机每到一小站, 就要降落卸货再装货, 然后再起飞. 假如不能把货都存在天上, 飞机不须降落或是起飞就可以卸货再装货, 这种好处就很有限了. 
<br />当然我必须承认, 量子计算是根据量子位元, 和我们熟悉的二进位很不一样. 量子计算有Peter Shor对分解质因数的算法比用普通计算机要快很多倍, 量子计算Glover对大数据库的搜索比用普通计算机快很多, 这些我都不懂.
不过我把这些归类到特殊应用上.  
<br />我觉得光量子计算应该先定位在像D-Wave那样的产品, 作为普通计算机的Attached Processor或是某些应用的硬件加速器. 先找些特殊的应用像是密码破解器, 因为他对存储的需要量不大, 对计算的要求非常大.
若是定位在一般用途的计算机, 那可是前途茫茫苦海无边. 
<br />超导的量子计算机就没有这样的问题, 它也有Josephson Junction 量子纠缠效应, 整个系统都可以用集成线路电信号的方式实现. 唯一欠的东风就是它需要在接近绝对零度液态氦的条件下才能运作.
如果能把温度提高到77开尔文度液态氮, 这个应用就会非常大. 
<br />中国本来就在高温超导的研究上领先, 若再继续努力, 把温度提高到77开尔文度液态氮, 就会有好几个大的应用. 
超导量子计算会大大的普及, 医学上的核磁影像MRI费用会便宜很多, 磁悬浮列车会节省很多电, 也可以降低长距离送电损耗, 以及用在核融合上的超导磁铁. 做这方面研究并不需要一个很大的团队, 可以长期继续努力. 
<br /><a href="http://www.chineseineurope.com/china/2169" target=_blank>光量子計算機誕生 速度領先世界</a>
<br /><img src=image/20170517.jpg alt="Erwin Schrödinger's Cat Duoduo in a paper box" />
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
