<?php require_once('php/_navchishin.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>东海和钓鱼岛</title>
<meta name="description" content="2016年3月底联合国大陆棚界限委员会裁定福克兰岛周围的大陆棚架都属于阿根廷的经济海域. 按这个判例, 钓鱼台列岛12海浬以外的大陆棚架全都属于中国的经济海域.">
<?php EchoInsideHead(); ?>
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _ChishinLayoutTopLeft(); ?>

<div>
<h1>东海和钓鱼岛</h1>
<h4>2017年5月24日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>大多数人都忽略了这段新闻, 这个判决却有着极为深远的影响. 
<br />经过了7年的诉讼, 2016年3月底, 联合国大陆棚界限委员会裁定, 阿根廷在大西洋的经济海域, 大部分由200海浬增加到350海浬, 福克兰岛周围的大陆棚架, 都属于阿根廷的经济海域. 
1海浬等于1.852公里, 阿根廷的经济海域因此增加了1700000平方公里.
<br />福克兰岛离阿根廷500多公里, 中间都是大陆棚架, 整个阿根廷外海都有四五百公里以上的大陆棚架. 
这次判决不牵涉到福克兰岛的主权归属, 它所说的是不管福克兰岛属于英国或是阿根廷, 福克兰岛周围的大陆棚架, 除了福克兰岛12海里的领海之外, 都属于阿根廷的经济海域. 
<br />钓鱼台列岛, 台湾和大陆情况极为类似. 台湾和钓鱼台列岛都在东海大陆架上, 台湾距离大陆200公里, 钓鱼台列岛距离大陆300多公里, 冲绳列岛在冲绳海沟里. 根据联合国大陆棚架界限委员会这个判例, 很可能的结果就是:
</p>
<ol>
  <li>不论钓鱼台列岛属于日本或是中国, 钓鱼台列岛12海浬以外的大陆棚架全都属于中国的经济海域.</li>
  <li>一旦台湾脱离中国, 将失去12海浬以外的大陆棚架, 包括台湾海峡.</li>
  <li>中国的经济海域会扩展到整个东海岸陆棚架的边缘一直到冲绳海沟.</li>
</ol>                
<p>没有人会怀疑联合国大陆棚架界限委员会在这方面的权威性, 它是联合国的常设机构, 由联合国支付薪水, 里面的委员和法官都是这方面的专家, 参与国际海洋法和大陆棚架界线的制定, 他们的功能就是根据国际海洋法制定大陆棚架界线.
当然他们不会参与任何领土的争端.
<br />这和南海仲裁庭很不一样, 设在海牙的国际仲裁庭是私人机构, 没有任何常设法官, 在过去117年当中, 它所处理过有关领土领海的仲裁案件不到8个, 在中国没有参与的情况下, 所有仲裁庭和法官的费用总共36000000美金, 全部由菲律宾出.
五位法官, 一个由菲律宾指定, 另外四个由日本前驻美大使柳井俊二指派. 在南海仲裁庭结果公布时, 联合国在网上宣布, 它们从未参与南海仲裁庭, 也不对了仲裁结果负责. 
<br />这个才是东海钓鱼台决定性的战场. 在这个战场上, 美国没有任何责任更没有任何借口帮日本看家护院. 拿下这个, 钓鱼岛就可以冷处理, 整个东海和钓鱼岛情势就会立即缓和. 台湾渔民去钓鱼岛海域捕鱼也不需要领日本情. 
<br /><a href="http://std.stheadline.com/yesterday/int/0330bo03.html" target=_blank>聯國: 福克蘭島水域歸阿根廷</a>
<br /><img src=image/20170524.jpg alt="Cat Duoduo trying to fish" />
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
