<?php require_once('php/_navchishin.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>隆中策(2) - 快马加鞭打造绿色钍核子家园</title>
<meta name="description" content="对尽早实现钍核能发电商业化的建议. 用齐头并进的做法. 在最优状况下大大缩短研发时间, 既不增加安全上的风险, 研发费用的增加也极有限. 做最好的打算, 尽量争取2024年初步开始商业营运钍核电厂.">
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _ChishinLayoutTopLeft(); ?>

<div>
<h1>隆中策(2) - 快马加鞭打造绿色钍核子家园</h1>
<h4>2017年5月23日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<blockquote>"思想再开放一点, 步子再大一点, 脚步再快一点."</blockquote>
<p>中科院在2011年底正式成立<a href="20170512cn.php">钍核能发电</a>项目, 700人的研发团队, 35亿美元的研发经费. 原先国务院希望能在2024年做出商务运转的核电厂. 在2014年, 中科院发布的消息是商务运转的钍核电厂可能要到2040年. 
我想这是Worst Case, 从规划上来说, 不只要做最坏的打算, 更重要的是要从Best Case上做计划做准备, 否则结果一定是Worst Case. 这篇通讯的目的, 就是谈如何规划, 做最好的打算, 也就是尽量争取2024年初步开始商业营运的目标.
很可能会延期, 不过必须寸土必争. 
<br />每早一年完成, 国家就可以省下2500亿元美金, 新的产业布局就可尽早开始. 这些省下来的钱, 足够支持国内各项计划和一带一路开拓的经费. 
<br />经过福岛事件后, 大家的想法都比较保守, 这是可以理解的. 看了央视在走近科学最近五集有关核能发电厂的影片, 了解更是深刻. 华龙一号最新的核电厂, 光是钢筋水泥外壳和地基, 就得用五年的时间建造,
外壳坚固, 即使用300吨的大飞机携带了75吨的汽油撞击, 也能保证安全. 高温高压水冷却铀核电厂, 一旦炉心熔毁, 会造成氢气爆炸, 高辐射性的水外流, 流到地下和地下水会合, 造成极严重的核污染事件. 这些教训都是值得让我们警惕的. 
<br />钍熔盐核子发电厂就和华龙一号完全不一样, 放射性的熔盐在普通大气压下工作, 也没有水份, 不会渗透到地底下, 熔岩温度过高就有不需电力控制的保险装置自动停止核子反应.
很容易就可以预防三哩岛, 切诺比, 福岛核电站这类核安事件的发生, 非常适合中小型的核电站. 如果建在地底下, 可以完全防止911式的恐怖袭击或是巡航导弹袭击.
小型核电站还有一个优点, 就是研发时间短, 容易大量生产. 这些都非常适合中国的长处, 而且还可以用在核动力潜艇或是核动力航母. 
<br />钍熔盐核能发电已经不是科学问题, 是工程问题. 最大的不确定因素就是在高强度核子辐射, 抗高温熔盐腐蚀金属的研发, 这直接关系到核子反应堆的寿命. 关于这点, 中科院宣布已经研发出领先世界的抗腐蚀合金.
其它的都是工程设计以及实现的问题, 包括了如何运转, 如何防止核扩散, 如何作废物处理等等. 
<br />以下是我对尽早实现钍核能发电商业化的建议, 它不是按部就班而是齐头并进的做法. 它可以在最优状况下大大缩短研发时间, 既不增加安全上的风险, 研发费用的增加也极有限.
因为篇幅有限, 所提的建议主要是一个大框架和方向, 希望专家们能批评修改和完善. 
<br />核能发电机可以分成两大块, 核子反应堆和气涡轮发电机, 中间有一至二层热交换器. 由加热过的氦气到气涡轮发电机. 这一块虽然体积很大, 基本上是相同的, 而且这一块不会受到核子辐射, 可以和核子反应堆完全分开. 
<br />在我的建议中, 核子反应堆, 多个厂房隔间, 气涡轮发电机从设计建造全都可以平行进行, 而且可以同时设计建造几种不同的核子反应堆, 同时放在不同的厂房隔间中测试. 
这样不同功率, 不同材料, 不同燃料循环核子反应堆都可以平行设计测试和生产. 
举例说, 从最小的用在核动力潜舰的核子反应堆, 0.0625GW, 0.125GW, 甚至0.25GW都可以平行进行, 尽量把每个功能模块化, 一起设计制造, 所花费额外的费用其实不高. 
<br />以下是厂房设计以及反应堆对发电机组配置的简单描述:
</p>
<ul>
  <li>核子反应堆可以有不同的设计, 你也可以把几个相同的或是不同的核子反应堆并排放在一起, 把经过每一个反应堆热交换器加热过后的氦气全部都送入同一个气涡轮发电机产生电力. 
      这样气涡轮发电机是共用的, 核子反应堆就可尝试各种不同的设计, 可大可小, 也可以用各种不同的材料. 最后把几个较小的核子反应堆热力汇集, 送到一个大气涡轮发电机.</li>
  <li>核子反应堆厂房可以兴建如下: 每4个一组, 挖长43公尺宽43公尺深16公尺大坑, 4周以及当中从左右方向以及上下方向都用一公尺厚的钢筋水泥墙隔离, 形成田字排列每一个20公尺长20公尺宽15公尺深的反应堆厂房.
      每个厂房又分两层, 最底层高2公尺, 个别有两个管道从上层通到下的燃料熔岩收集容器里, 正中心的容器是来收集反应堆破裂时泄漏在地上或是反应炉旁边的核子燃料.
      侧边的容器是用来在紧急情况下烧熔闸门, 收集反应堆里的核子燃料, 停止核子反应. 闸门可以因为反应堆温度太高自动烧熔, 也可以因为核子燃料泄漏或是厂房压力太高, 或是厂房辐射强度太大以自动或是人工控制方式通电烧熔.</li>
  <li>另外再加镉控制棒来吸收中子, 假如原子堆反应过快. 大多数的场合这都不需要, 因为只要温度上升, 核子反应速度就会自动降低. 如果一切方法用尽还没有效果的话, 就采用紧急关机的办法.</li>
  <li>反应堆应该用起重机从上方吊下安装, 所以反应堆不应该太大太重. 坏了的反应堆先用厚铁板围住, 再用起重机吊起运走.</li>
  <li>知道某种中型反应堆(0.125GW或是0.25GW)能稳定运转时, 就把四个这种反应堆放进一组田字型的厂房, 把氦气管的输入输出会合接上气涡轮发电机, 就可以有0.5GW或是1GW电力输出.
      这种安排的好处是可以单独修复或是更新某一个反应堆, 发电输出不致于完全中断.</li>
</ul>
<p>这样很有可能在最佳的情况下, 能够把初步的商业营运提前到2024年. 当然也很有可能碰到意想不到的困难, 比如说抗腐蚀的合金一直过不了关. 
抗腐蚀合金直接影响到反应堆的寿命, 钍核反应堆大量生产会很便宜, 如果反应堆的寿命只能到10年, 只要有办法很快检查出来, 又可以很容易更换的话, 我觉得可以就先用着, 同时研发出更好的合金, 这样总比干等着强. 
<br />若把商业运转遍地开花提前10年, 就可省下25000亿美金. 参与这个项目需要热情和使命感, 这样才有初创公司的积极性, 使不可能变成可能. 
<br />还有一件很重要的事情, 就是要保护好钍矿资源. 内蒙古的钍矿是随着稀土元素而生, 因为没有立即需要, 提炼出稀土元素后就把剩下的钍当成废料抛弃了. 
才开采30年的稀土元素, 就抛弃了70000吨的钍, 那可以供给全中国40年所有Energy需求啊!!!
<br /><img src=/woody/res/cateyes/models/baozi/srilanka.jpg alt="Scottish fold female cat and British shorthair male cat in front of a Sri Lanka jewelry map" />
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
