<?php require_once('php/_navchishin.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>隆中策(1) - 绿色核子家园</title>
<meta name="description" content="钍是大自然给人类的恩赐. 钍核子发电可以带给人类千年甚至万年充沛的能源. 钍核反应炉的重要性比C919高几十倍, 不但对中国有很大的好处, 对全人类也是做出巨大的贡献.">
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _ChishinLayoutTopLeft(); ?>

<div>
<h1>隆中策(1) - 绿色核子家园</h1>
<h4>2017年5月12日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>钍是大自然给人类的恩赐, 它会造福全人类, 特别是对中国人. 它会改变人类的生存环境. 它也会改变世界的政治格局. 它也会大大减轻人类对自然资源的争夺, 使得很多难以解决的问题, 比如南海问题, 可以得到解决.
当然这些都是我的预言. 前几天和两位好朋友李祖炜和吴秉渝在公园里散步, 大谈世界百年大计, 把我们的观点用白话说出来. 
</p>
<ol>
  <li>只要1800公吨的钍核能发电就能满足全中国2009年一整年的所有的能源需求, 包括石油, 天然气, 煤, 水力发电, 风力发电, 太阳能和地热等等.</li>
  <li>提供全中国一年所需能源发电所产生的核废料总共体积是10公尺*10公尺*0.6公尺. 核废料大约300年后就丧失辐射性, 若是每年用1800公吨的钍作为核能发电, 总共需要储存核废料的体积300*10*10*0.6=170*170*0.6立方公尺, 不管多久以后.
      因为300年后, 每年进去多少核废料, 也可以拿出同样体积失去了幅射性的核废料. 这比铀核反应要小千倍以上.</li>
  <li>中国现在已探明的钍工业储备量有280000吨, 足够支撑中国145年的能源消耗. 包头稀土研究院估计, 光是内蒙古的钍矿资源就可支撑中国五千年的能源消耗.
      另外有资料显示,  钍在地壳成分有百万分之10, 大约是铅的含量60%. 我大约计算了一下, 只要能开采其中的万分之一, 就足够全球人类20000年的需要.</li>
  <li>钍核子反应炉绝对安全. 像在宫城大海啸电力完全中断的时候也可以保证安全. 平时在摄氏700度运转, 若是温度过高, 闸门就会融化让燃料进入有吸收中子物质的储藏罐里, 让核子反应无法进行.
      钍金属可以从开采稀土元素中的废料中提炼, 还可以减少污染.</li>
  <li>钍核子反应炉不可能产生用于核武器的材料, 这就是60多年前美国不向这个方向发展的原因. 现在看起来这变成了它的好处.</li>
  <li>钍核子反应炉在常压下进行. 很适合做小型的核子反应炉用在核子动力潜艇或是核动力航母.</li>
</ol>
<p>钍核子发电可以带给人类千年甚至万年充沛的能源. 核废料体积够小, 放射时间够短, 保存不困难. 没有碳排放, 可以解决地球暖化的问题. 没有废气排放, 可以解决空气污染的问题. 电力可以用在海水淡化, 可以解决水资源短缺的问题.
取代煤炭和石油, 解决了酸雨的问题. 
<br />钍核子发电对中国的好处最大. 中国是能源消耗和进口最多的国家, 每年至少花2500亿美元外汇进口石油天然气煤炭, 这些又造成严重的空气污染. 85%的石油是经过海上运输, 漫长的运输通路很难防守. 碳排放的限制会限制中国GDP的成长.
每年省2500亿美元的外汇, 每100年就节省了25兆美金. 对全世界来说, 节省的数目还可增加3倍.
<br />钍核子发电能使中国自给自足, 运输方便, 可以全面解决上面所谈到的所有问题. 有了足够的自然资源, 这个世界会更加和平, 举例说, 花费很多精力去争夺南海资源不如尽快发展钍核能发电, 提炼钍, 投资收购钍矿场.
举例说, 内蒙古有很多钍矿, 我相信蒙古也会有很多, 现在钍矿一点都不值钱, 而且过去这几年原物料大跌, 蒙古陷入极大的经济困境, 现在正是投资收购的时候. 
<br />上面谈的是技术面, 下面谈如何尽早实现. 
<br />在以色列的Weitzman Research Institute, 他们审批研发项目的标准是每单位投资对GDP的增加会有多少, 会有多快. 不符合他们标准的研究项目, 都让给美国去做. 
因为政府支持的研究经费, 都是来自民脂民膏. 以色列小国寡民, 资源缺乏, 创造了经济奇迹, 他们经济的发展完全靠创新, 靠对科学与技术研究发展项目投资的精打细算. 
若以他们的标准来衡量, 高能粒子对撞机就要排在最底部, 这点我们都能感同身受. 得分最高的, 应该就是钍核子发电.
<br />钍核反应炉的开发, 应该不比当年的铀钸Fast Breeder困难. 应该安排精兵强将, 在最短的时间内把它做出来. 只要提前一年, 就可节省2500亿美元, 而且其他基础建设的布局, 也会随着这个改变. 越早知道这个答案, 改变的成本就越少. 
钍核反应炉的重要性比C919高几十倍, 不但对中国有很大的好处, 对全人类也是做出巨大的贡献. 
<br /><img src=image/20170512.jpg alt="Cat Duoduo with light bulb" />
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
