<?php require_once('php/_chishinmenu.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>如何从美国封杀中兴通讯的危机变成转机之六 -- 给中兴通讯和华为提个建议</title>
<meta name="description" content="美国封杀中兴通讯, 如何从危机变成转机之六? 给中兴通讯和华为提个建议. 把5G技术, 用在固网通讯的无线本地环路, wireless local loop WLL, 特别在开发中国家. 它的好处是把宽带网络服务很快就覆盖到整个地区上.">
<?php EchoInsideHead(); ?>
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _LayoutTopLeft(); ?>

<div>
<h1>如何从美国封杀中兴通讯的危机变成转机之六 -- 给中兴通讯和华为提个建议</h1>
<h4>2018年5月15日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>5G移动通讯技术虽然进展非常快, 5G手机市场的开展会比想象慢2到3年.
现在的4G网络还没有堵塞到需要立即升级到5G, 也还没有出现杀手级应用在手机上需要增加很多数据流量, 这自然会影响运营商购置5G移动基站的计划, 也自然会延缓5G手机的销售. 
<br />建议把5G技术, 用在固网通讯的无线本地环路, wireless local loop WLL, 特别在开发中国家. 它的好处是把宽带网络服务很快就覆盖到整个地区上. 
中兴和华为都有很大的业务在光纤通讯上, 它们帮世界许多发展中的国家铺设光纤, 销售整套通讯设备. WLL就可以把光纤通讯的终端很快的延伸到附近的每个家庭用户里. 让用户立刻就能享受到宽带网络的好处. 
<br />提供了这样一个完整的解决方案, 就可以大大加速了中兴华为在第三世界的业务. 否则只有光纤, 进不了每个家庭, 人家在规划上还是有很多犹疑. 
美国, 日本和欧洲虽然有技术, 可是几乎没有听说它们愿意到发展国家去铺设光纤, 帮助搞基础建设. 在这方面中兴华为有极大的优势. 这个市场也有极大的潜力. 
<br />我们从下围棋的眼光来看全球的通讯市场. 中兴华为在光纤通讯上已经形成了两条龙. 这两条龙必须做成两个眼才能永远存活. 这两个眼一个是光纤通讯用的芯片.
另外一个就是有源或是无源的光学器件, 必须用各种方式来保证未来的供应. 
<br />保住了这条龙, 下一个关键点就是5G射频芯片, 有了它就有了完整的5G技术. 然后再用5G技术配合光纤通讯打进第三世界的固网通讯和移动通讯. 
<br />50年前我看过一篇有关世界农村和世界城市的文章. 今天来看中兴华为不正是在通讯世界的态势里, 从世界农村包围着世界城市? 世界农村的人口占着全世界80%.
也就是未来80%的通讯市场会在世界农村, 这也难怪美国紧张. 华为放弃美国市场是正确的战略决定. 以后更是要谨言慎行避免制裁, 同时还要有整套计划, 即使制裁了也不怕. 
<br />在上两篇文章里, 我提到了802.11ad. 我看到它最高的数据流可达6.7Gbps, 用相控天线数组雷达技术可传200米, 就十分兴奋, 以为它可以用来做WLL. 
后来仔细查阅了数据, 氧气对它的载波频率60GHz吸收实在是太厉害了, 而且这个频段只有美日欧开放. 所以我收回用802.11 ad做WLL的推荐, 并向大家道歉. 
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
