<?php require_once('php/_chishinmenu.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>如何从美国封杀中兴通讯的危机变成转机之二 -- 诊断与药方</title>
<meta name="description" content="美国封杀中兴通讯, 如何从危机变成转机之二?  诊断与药方. 一个月前, 大家还在为中兴华为在5G网络的快速发展而自豪, 但在中兴通讯被美国一剑封喉之后立即休克, 就突然感到自己缺芯少魂, 这到底是哪里出错了?">
<?php EchoInsideHead(); ?>
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _LayoutTopLeft(); ?>

<div>
<h1>如何从美国封杀中兴通讯的危机变成转机之二 -- 诊断与药方</h1>
<h4>2018年4月29日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>这是临时加进来的题目, 我觉得很紧急, 大家也会很感兴趣. 
<br />一个月前, 大家还在为中兴华为在5G网络的快速发展而自豪, 但在中兴通讯被美国一剑封喉之后立即休克, 就突然感到自己缺芯少魂, 没有核心技术. 一方面要注入1500亿资金, 另一方面要增加40万芯片技术人才.
<br />这到底是哪里出错了? 在这里提出我自己的看法和建议. 
<br />首先, 中国这些年在通信和芯片设计领域上确实是有了非常大的进展. 华为5G网络已经通过了德国电信的测试, 设备可以卖进欧盟. 这表示华为既有硬件, 又有软件. 
两个月前, 在世界移动通信大会上, 华为的5G手机样机用了海思开发的5G基带芯片, 和高通的5G手机样机比试, 华为的样机在各方面性能上都胜过高通. 
这是了不起的成就, 不但证明华为有5G基带芯片, 更有通讯软件, 而且还迎头赶上了高通. 高通在以CDMA为基础的2G/3G/4G/5G无线通信标准上面有基本的专利. 任何手机厂商都要对高通付专利费. 
去年一年, 中国的手机厂商就给高通付了六七十亿美金的专利费. 华为也有别人无法绕过的专利在5G的标准里面. 这就是为什么美国总统要亲自出面否决高通被外国公司并购. 为什么又在封杀中兴通讯之后又剑指华为. 
<br />在过去26年里, 我和一百多位刚从大陆刚毕业的博士硕士生一起工作过. 他们来自清华/北大/上海交大/浙江大学. 他们都工作勤奋, 工作能力上一点都不比从史丹佛大学, 加州柏克莱分校招来的硕士生博士生差.
我们一起设计过各种芯片, 研究过各种算法还有做过各种系统应用. 中国人在这方面天生的能力上是绝对没有问题的. 问题到底出在哪里呢? 
<br />从初中开始, 我就有读书买书的习惯. 每次到书店, 一呆就是就是三小时, 翻阅各式各样的科技书籍. 50年前来美国后, 就常常翻阅在我研究领域里的论文杂志. 这个习惯一直都没有改. 
从22年前开始, 每次一到北京就去海淀区的图书城. 一到上海就去上海书城第六楼. 因为那里有各式各样的给专业人士看的科技书籍, 都是大陆专家教授们写的, 不是翻译的.
内容包罗万象, 有4G无线通信原理/GPS导航/语音以及图像处理/导弹以及雷达系统等等. 所有我想学的都有, 而且特别便宜, 平均一本只要七块美金. 我每次去就抱了一大堆回来, 行李箱里一半的重量就是这些书. 
我最后的一个公司想到做<a href="../woody/blog/entertainment/20120811cn.php">GPS</a>, 就是因为我手上有八九本从大陆买的有关GPS的书, 其中还有一本附了一张有GPS程序的光盘片. 虽然这些程序后来发现过于简陋, 至少帮我起了个头. 
<br />可是在这么多年里, 我从来没有看到一本大陆专家写的仿真集成电路设计用来给专业人士参考的书籍. 没有书出版就表示没有人会, 或是没有人有时间写, 或者是没有人有兴趣看.
18年前, 我在大陆招来的工程师从来没有听说过CMOS可以做射频集成线路. 我亲自带了一个清华的毕业生做GPS射频芯片, 带得十分辛苦, 最后还是从斯坦福大学招来的一个硕士生完成设计.
投片两次终于成功, 路测结果和市场买来的, 芯片一模一样. 这还是所有通讯, 射频系统最简单的一个设计. 手机射频要复杂的太多了. 
<br />问题在哪里? 问题就在国内各大学没有射频集成线路的专家, 自然就没有这样的科研项目甚至课程, 自然就教不出有射频集成线路基础的学生. 做研究或者做系统的示范, 就从市面上买一些低级程度的器件组装而成.
国内做数字芯片/算法/软件/整个通讯系统都不是问题. 问题是要做小/轻/省电/便宜的无线通信系统, 一定要把射频集成到单一芯片里.
<br />做一个简单的比喻, 今天中国可以制作设计各式各样的飞机, 只有飞机右边的翅膀做不出来. 或者说, 我们可以设计制造给右脚穿的鞋子, 可是给左脚穿的只是草鞋. 
我相信国内今天也有这方面的专家, 很可能是海龟, 可是他们忙着开发他们自己特定的产品, 没工夫大规模培养这方面的人才. 
<br />怎么解决这个问题? 
</p>
<ul>
  <li>第一. 集中精锐全速开发5G射频集成线路. 军方肯定有很多精通射频的高手, 可是很可能不懂射频集成线路的设计. 有经验的海归肯定是主力. 还需要高价从海外邀请这方面的专家做短期的顾问.
      UCLA加州大学洛杉矶分校是这方面研究的领头羊. 一个教授叫做Samueli创办了博通Broadcom, 另外一个教授叫做Albidi, 他们都是伊朗人. 发表了很多文章. 也带出了很多伊朗学生. 
      我以前跟几个谈过. 伊朗学生在这方面根底都很扎实.</li> 
  <li>第二. 寻找合作伙伴, 就像我在上一个电子邮件里面说的签订设计和供货合同. 来降低风险, 保证供货. 这个合作伙伴可能是联发科. 也可能是三星. 荷兰的恩智浦. 或者是日本公司. 
  	  只是日本公司做决定或者设计都很慢. 恩智浦距离遥远, 可能有沟通的问题. 三星不知道在这方面的经验如何?</li>
  <li>第三. 建议在深圳, 上海, 北京三地, 建立三个, 模拟集成线路设计服务公司. 他们的宗旨有三. 
  	  <ol>
  	  	  <li>研究并且建立设计模拟集成线路的能力. 包括射频集成线路.</li>
  	  	  <li>到重点大学作专题演讲. 并且训练学生以及教授们在这方面的能力.</li>
  	  	  <li>对其他企业单位提供仿真集成线路设计的服务.</li>
  	  </ol>
  	  这三个公司的负责人必须是海归. 有这方面的工作经验. 对技术有深入了解. 这样才能建立带好整个技术团队. 这三个公司总共每年的开销, 大约是2000万美金. 
  	  训练组建好团队建立好信誉以后就可以从设计服务方面, 得到收入. 从产品收取权利金, 以后可以有盈余.
  </li>
</ul>
<p>这几件事都是比较急的. 下一篇文章我会谈到遍地开花. 
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
