<?php require_once('php/_navchishin.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>如何从美国封杀中兴通讯的危机变成转机之一</title>
<meta name="description" content="美国封杀中兴通讯, 如何从危机变成转机之一? 亡羊补牢. 这次美国封杀中兴通讯, 给大家敲响了警钟. 以后必须扎实根基才能稳步向前. 否则有可能爬得越高摔得越重. 中兴就是一个活生生的教训.">
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _ChishinLayoutTopLeft(true); ?>

<div>
<h1>如何从美国封杀中兴通讯的危机变成转机之一</h1>
<p>2018年4月26日
<br />作者: <a href="indexcn.php">王继行</a>
<br />这次美国封杀中兴通讯, 给大家敲响了警钟. 以后必须扎实根基才能稳步向前. 否则有可能爬得越高摔得越重. 中兴就是一个活生生的教训.
在和平年代, 你只要卖你有的就可以过得很好, 在战争年代, 对手就会专门找你没有的地方来打, 只要缺一样, 就有可能致命. 
<br />这篇文章分3大部分. 第一部分是亡羊补牢. 讨论通讯企业如何紧急自救. 第二部分是遍地开花. 讨论如何培养强大的集成电路设计团队, 填补在各个领域的空白. 
第三部分是向上腾飞. 讨论在某些特定领域超车, 开创出我们的天地. 我们不需要怨天尤人, 更重要的是要有信心, 有热情, 仔细规划, 大步向前, 必定能浴火重生, 再创辉煌. 
<br />第一章 亡羊补牢 
<br />中兴通讯该怎么办? 我根据的是, 后面附上的一篇文章. <?php EchoLink('http://tech.qq.com/a/20180418/008367.htm'); ?>
<br />中兴通讯的业务有三大板块. 智能手机, 光通讯和无线基站. 
<ol>
  <li>如果美国不放松管制, 我建议放弃智能手机业务. 没有安卓操作系统, 因为没有生态圈支持, 做出来的手机也不会有人要. 中国还有华为, 小米, oppo, vivo 四个手机大厂. 少了中兴也不会有太大影响.
      而且这方面市场萎缩, 利润又薄. 不如集中力量, 管好其他的事业板块. 不过其他手机厂家, 还是必须尽快把漏洞补全. 华为还是要继续完成它的操作系统的开发. 我相信程式的开发应该不是问题. 
      最难的待机时间的长短, 就是在休眠时把DRAM放在什么模式. 十多年前我们在上海的工程师都写过自己的操作系统. 平时虽然没用, 可是一旦美国对中国所有手机厂家都禁用安卓操作系统, 这个可就是救命的了.
      那时候我相信所有的中国应用软件公司, 都会把应用放在华为的操作系统上. 这样新的生态圈就形成了. 其他的手机芯片组, 还需要加速去完成量产. 不过这就不需要中兴通讯去操心了. 
  <li>光通讯芯片, 复杂度和设计原理相对简单得多, 公开的文章基本上都可以找得到, 只是速度和可靠性要求极高. 50G或以下的自给率都还可以. 明年芯耘光电就会有100G的方案. 
      重要的是要确定整套芯片组能满足系统的需要. 听起来问题不大. 
  <li>无线基站芯片. 主要分成基带芯片和射频模拟前端. 华为的海思已经能够大量生产基带芯片. 主要的问题是射频模拟前端. 现在的系统是用大多数由美国厂家提供的低集成度基本上是单一功能模块的芯片组装而成.
      大陆厂家也有一些类似功能的芯片, 正在测试验证中, 自给率相当不够. 若是能够从日本韩国欧洲很快补齐, 还可以暂渡难关. 即使能够, 这也只不过是暂时的. 
      真正的决战点是把整个射频模拟前端集成到单一芯片和另一个GaAs或GaN功率放大器上. 否则就做不出人口密集地区的5G微基站以及5G手机. 这里面不需要很高端的生产制作工艺, 需要的是5G射频系统大规模集成线路的设计人才. 
      而且这种人才, 正是今天中国大陆所稀缺的. 
</ol>
<br />所以今天的中国企业, 特别是华为海思, 还有展訉和其他有一定能力设计5G射频芯片的公司必须正确评估是否在短期间有能力, 有信心, 设计出这样的一个芯片. 
若是不行, 就试着看一看把这些公司的精兵强将调集在一起, 是不是能够短期做出来? 若还是不行, 就需要到外边找合作伙伴, 和自己联合小组的项目同时进行, 互不干扰.           
<br />台湾的联发科就是一个很好的榜样. 他们在20年前就和新竹的交大一起研究CMOS射频集成线路. 11年前又并购了美国ADI的手机射频部门. 过去十多年, 每年都在世界集成线路大会ISSCC在这个领域发表一两篇论文. 
做出了很多无线通讯的产品, 例如蓝牙/WIFI/手机射频芯片. 在这方面人才济济, 他们又很想进入中国市场, 是一个很好的合作对象. 为了让合同尽快进行, 我建议只要定一个很简单的合约就行. 
<ol>
  <li>大陆提出芯片规格, 联发科研究是否能做, 并提出工艺要求. 是否能在中芯半导体生产? 
  <li>大陆预付几百万到几千万美金的定金. 设计在大陆进行. 不需要雇用大陆的员工. 也不需要转移任何设计技术, 芯片必须在中芯半导体生产. 也必须在中国大陆做封装和测试. 
  <li>在202X前, 大陆保证每年以市场价格购买xx数量. 
  <li>联发科保证以市场价格满足大陆以后, 提出所有的需求. 只要这些需求能被大陆的中芯半导体和封装测试厂家实现. 
</ol>
<br />我想这是一个非常公平互惠的合约, 联发科得到了研发资金和进入中国市场的机会, 又不必担心技术的流失, 大陆得到了一个早日供货的机会. 而且以后不必担心美国的禁制令. 
</p>
</div>

<?php _ChishinLayoutBottom(true); ?>

</body>
</html>
