<?php require_once('php/_chishinmenu.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>如何从美国封杀中兴通讯的危机变成转机之四</title>
<meta name="description" content="美国封杀中兴通讯, 如何从危机变成转机之四? 这是这一系列文章里最重要的一篇. 因为牵涉到的方面很多, 就以纲要式的方式列出, 细节就请大家慢慢体会. 以后我还会拿些实际例子作说明.">
<?php EchoInsideHead(); ?>
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _LayoutTopLeft(); ?>

<div>
<h1>如何从美国封杀中兴通讯的危机变成转机之四</h1>
<h4>2018年5月8日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>这是这一系列文章里最重要的一篇. 因为牵涉到的方面很多, 就以纲要式的方式列出, 细节就请大家慢慢体会. 以后我还会拿些实际例子作说明. 
</p>
<ul>
  <li>第一. 核心技术必须以产品的形式由公司推出. 由市场竞争的机制, 不断创新, 不断改善. 这样才能持久才有生命力.</li>
  <li>第二. 生产线的成功, 不只是靠先进制程和生产线的管理, 必须靠广大的IC设计公司产品的支持. 海外的市场基本上已经被台积电囊括.
      再加上政治的因素, 国内半导体生产线的成功就取决于国内的IC设计公司产品开发的速度.</li>
  <li>第三. 半导体产品的开发需要很多人才, 国内的人才储备不足, 远远不能满足需要. 人才制约着整个半导体产业的发展, 这些不是单单靠钱就能解决. 
  	  如何大量, 快速, 高效地培养半导体产品开发的人才, 并且立刻投身在产品开发上, 就是半导体产业成败的关键.</li>
  <li>第四. 人才要靠教育. 从学校培养出来. 现在的问题是培养的时间太长. 学生跟着教授的研究课题做. 
  	  这些研究课题不一定是工业界急需的, 学生毕业后不一定能找到最适合他在学校所学的工作, 工业界也不一定能找到最适合它需要的学生. 怎么解决这个问题?</li>
  <li>第五. 我在这里提出建议. 它需要财政, 产业规划和教育政策的支持. 我希望它能够把公司的构成, 产品开发的进程, 学生们的培养和工作, 教授们的科研项目和方向一起解决. 
  	  这个问题十分重要, 请大家一起讨论, 提出修改意见, 形成共识, 供国内做参考. 
  	  <br />10% , 200 不是一个硬性的数字, 只是为了说明方便. 
  	  <ol>
  	  	  <li>建议将半导体开发基金的10%, 约47亿美金, 保留做半导体产品开发以及成立公司之用.</li>
  	  	  <li>这47亿美金, 大致可分为200个项目, 每个项目慎重选择技术负责人. 再以创业孵化器的方式, 在大学附近或在大学内, 成立200个准公司.</li>
  	  	  <li>准公司和学校的某个教授或是某个教研组紧密绑在一起. 准公司提供经费给教授或教研组专门研究该准公司要开发的产品. 教授也提供还没有毕业的学生, 给准公司, 由准公司训练, 并参与准公司实际的产品开发项目.</li>
  	  	  <li>经准公司核准, 某些产品有关的研究, 可作为论文或是毕业论文发表.</li>
  	  	  <li>参与实际产品开发的学生, 也可以从产品开发的工作里, 获得学校承认学分.</li>
  	  	  <li>若是产品开发工作进度紧张, 经公司申请, 学校批准, 学生也可以半工半读, 甚至暂停学业, 等到产品开发项目到一个段落时再继续学业.</li>
  	  </ol>
  	  这样的安排有许许多多的好处. 
  	  <ol>
  	  	  <li>对准公司的好处. 
  	  	  	  <ul>
  	  	  	  	  <li>准公司可以立即得到很多参与培训后工作的学生. 若是工作表现满意, 毕业后就变成公司的正式员工. 这样就能相当的程度上解决人才来源的问题. 让项目尽快启动.</li>
  	  	  	  	  <li>和教授教研组挂钩. 就等于得到一个延伸出来的研发部门.</li>
  	  	  	  </ul>
  	  	  </li>
  	  	  <li>对学生而言. 
  	  	  	  <ul>
  	  	  	  	  <li>可以很早就参与实际产品的研究, 或是开发工作. 这样能够早点知道他们是否适应. 来决定他们未来发展的方向.</li>
  	  	  	  	  <li>学生很早就会知道他们以后是否会有他们喜欢的工作. 不必忙着到处找事.</li>
  	  	  	  	  <li>早点知道他们以后会做什么样的工作, 这样他们就会知道该选什么样的课.</li>
  	  	  	  </ul>
  	  	  </li>
  	  	  <li>对学校教研组的好处. 
  	  	  	  <ul>
  	  	  	  	  <li>从准公司里 得到研究经费.</li>
  	  	  	  	  <li>实际产品的研究有商业价值. 随着产品的不断改进, 也增加他们研究的水平.</li>
  	  	  	  	  <li>稳定的研究方向. 教授们不需要东一榔头西一棒槌的寻找项目.</li>
  	  	  	  </ul>
  	  	  </li>
  	  	  <li>从整个国家角度来看. 
  	  	      <br />原本要做那么多事情到处都缺人. 用这种方式可以立刻大量使用培养人才. 教授们也需要从国家拿到科研经费. 科委的工作千头万绪, 教授们各说各话, 很难评定项目的成果. 
              现在上面只要制定产品规划. 每个产品有技术负责人. 再由技术负责人透过准公司和学校教授们规划研究项目. 产品开发基金相当的一部分就用在科研上.
  	  	  </li>
  	  </ol>
  </li>
  <li>第六. 今天的时机非常的好. 在这方面集中投资, 让产业飞速发展. 全国都有共识. 资金已经到位, 学生们想选择这个行业的积极性, 我想一定也非常高. 国内有许多大学, 里面又有许多优秀的学生. 
      如何把他们尽快培养出来, 让他们早点参加产品的开发. 让他们充分发挥他们的潜力, 让各式各样的产品随着准公司到各大学遍地开花是重中之重. 这种模式如果能成功, 产品开发的费用会大大降低. 
      若是没有人, 再多的钱, 再多的计划, 都没有用. 人才不够的话, 项目再多, 只会彼此挖角, 效果反而是负面.</li>
</ul>
<p>下面的几段文字是我原先的草稿. 本来是那样写的. 不过我后来发现, 按照这样写法, 等到谈到重点时. 读者的耐性已经没有了. 所以改成上面的文字. 只是已经写的, 又舍不得删去. 就留著作为参考吧. 
<br />一个星期前从报纸上看到, 470亿美金半导体发展基金已经设立. 一定是想成立一个像台积电的半导体生产线, 周围环绕着一堆设计公司, 再加上封装测试厂, 形成一个完整的产业生态圈. 
<br />要这条生产线能够像台积电那样健康成长, 是一条遥远的路. 不是砸下多少钱就能办到的. 问题不在于最先进的制程. 我认得的一些专家们, 对他们开发先进制程的能力, 一直到生产工艺的极限, 深具信心. 
问题是, 台积电早已根深蒂固, 它的客户早已遍布全球. 台日, 欧美, 甚至中国大陆的半导体产品, 大多是在台积电生产. 要把现在的产品转到大陆的生产线生产非常困难. 
需要一套新的模板, 再去投片生产, 再筛选封装, 测试各种性能, 包括可靠性测试, 还要想办法提高成品率, 这些过程还要记录, 报告给大客户, 得到客户的同意. 可以想象到中间花的钱和时间.
所以要这条生产线发展壮大, 必须要靠自己开发出来的产品. 
<br />即使用在美国的费用来算, 470亿美金的基金, 只要拿出其中的1/10, 就可以开200家以芯片设计为主的公司. 
产品若是选对的话, 200家公司其实也不少了. 但更重要的问题是这200家公司的人才从哪里来? 若是人才不够, 彼此相互挖角, 只能变得更糟. 
<br />另外我们还必须确定这个原则, 产品技术的开发必须不侵犯别人的知识产权. 也就是不用别人的商业机密, 不到别的公司挖角来做同样的产品. 不侵犯别人的专利. 
技术和产品的开发, 可以根据公开发表的资料, 或是自己创新, 或是得到授权使用. 
<br />这个游戏规则必须严格遵守, 否则后果严重. 在美国, 若是一个研发团队, 因接触到对方的商业机密, 受到污染. 整个团队必须解散, 项目作废, 根据这个做出来的产品也不能进入市场, 卖到市场的产品, 还要做赔偿.
若还要开发同样产品, 必须另建团队, 在干净的隔离室里进行, 一切过程都要做记录. 
</p>
</div>

<?php _LayoutBottom(); ?>

</body>
</html>
