<?php require_once('php/_chishinmenu.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>如何从美国封杀中兴通讯的危机变成转机之三 -- 对中国半导体产业布局的建议</title>
<meta name="description" content="美国封杀中兴通讯, 如何从危机变成转机之三? 对中国半导体产业布局的建议. 这一次对中兴通讯的封杀, 正好帮助中国下定决心, 全面发展半导体产业. 我相信历史会记下这个事件.">
<?php EchoInsideHead(); ?>
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _LayoutTopLeft(); ?>

<div>
<h1>如何从美国封杀中兴通讯的危机变成转机之三 -- 对中国半导体产业布局的建议</h1>
<h4>2018年5月4日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>这一次对中兴通讯的封杀, 正好帮助中国下定决心, 全面发展半导体产业. 中国每年进口2000多亿美金的芯片. 这些芯片, 绝大部分中国都有研发的能力, 而且在3到5年之间, 都能大量生产. 
这样不但能节省大量的外汇, 而且不再受制于人. 更重要的是, 在这个过程中, 积累了技术和人才, 为以后技术的提升和新的领域的开拓打下坚实的基础. 
我相信历史会记下这个事件, 我更希望在十年后, 我们能很高兴的告诉美国, 并感谢他们, 没有他们, 我们哪会有今天? 一笑泯恩仇. 
<br />从半导体产业的布局来看, 首先生产线必须集中. 这个要以台积电为榜样, 另外还需要一个像创意这样作为台积电设计后端服务的辅助公司. 大陆已经有这方面的技术和管理人才. 只要资金到位. 应当水到渠成.
台积电在20个月就建成16纳米的生产线. 
<br />但是光有生产线还不够, 必须要有产品来喂它, 否则上百亿美金的生产线, 就变成鬼城. 产品大致分为这三大类. 
</p>
<ul>
  <li>第一类. 存储器, 像DRAM, NAND flash. 这些就像白米饭, 可以用它来填肚子, 但是没有什么特别营养. 大陆在这两样产品都早已启动, NAND flash就要开始大量生产. DRAM 已经投片, 还在调试阶段.
  	  这类产品都需要长时间来提高成品率和可靠性, 而且以后还要不断的改进制程, 降低成本.</li>
  <li>第二类. 通讯和消费电子产品. 几乎你所能看到所有的电子产品, 除了计算机和服务器以外, 都可以归到这一类. 这一类就像鸡鸭鱼肉和蔬菜, 好吃又有营养. 
  	  我虽然没有准确数字, 直觉估计, 第一类加第二类, 占了整个芯片市场的80%. 除了Intel和AMD, 都属于第一类或第二类. 从数目来说, 95%以上的芯片公司都属于第二类. 
  	  <br />从上个世纪80年代末起, 整个通讯和消费电子技术开始了一场数字化的大革命. 它改变了所有消费性电子产品, 更开启了因特网的时代. 所有的信息包括语音图像和视频从仿真转到数字, 
  	  这些信息的传输和储存, 也从仿真转到数字. 在这以前, 日本绝对主导了甚至是垄断了整个市场. 而在这以后, 美国, 韩国, 台湾的芯片公司, 加上大陆的组装工厂, 加上各个大厂家的品牌, 逐渐取代着日本的地位.
  	  这也是日本经济失落了二三十年的一个很主要原因. 
  	  <br />这些产品包罗万象. 包括了手机, GPS 导航, 随身听, iPad那一类的平板, DVD光盘播放器, 硬盘, 路由器, 电视机, 摄像机, 录象机, 甚至AI功能的监控器, 各种标准的WIFI, 蓝牙, 无线识别标签, NFC, 智能手表手环,
  	  智能电表, Cable modem,  ADSL, VDSL, PLL反正你能看得到或是想得出的新鲜产品, 几乎都属于这一类. 
  	  <br />我一开始就关注这一方面的发展, 试图了解这方面的技术和算法, 以及如何用芯片来实现. 因为每一样都可能是一个创业的机会. 
  	  后来我又和清华大学的教研组, 还没有毕业的学生们, 后来又和已经毕业的学生们, 一起工作并开发一整套芯片产品. 我很高兴的发现, 他们完全有能力担负芯片以及相关软件开发的工作. 
  	  虽然我在<a href="20180429cn.php">上一篇</a>也指出, 国内大学在射频和模拟集成线路上的教育有盲点, 但这些我相信可以用相当短的时间补齐. 
  	  到底这些, 在国外已经发展了几十年. 会的中国人不少. 海归的应该也有, 只是每一种芯片组都需要模拟或是射频芯片. 所以需要大量培养人才, 并在学校生根发芽.   
  	  <br />在这一片领域上可以加重投资. 容易看到成果, 见到利润. 培养并吸引更多的人才进到这个领域来. 让整个芯片产业和队伍, 壮大起来.
  </li>
  <li>第三类. 计算机和服务器. 这里主要是由Intel和AMD的x86 CPU为主的芯片. 它是芯片中的极品. 服务器芯片每片可以贵到5000美元. 这一类就好像鲍鱼和海参. 
  	  <br />30年前我们公司, 做出了387管脚兼容的浮点协处理器. 立刻就有市场而且替公司产生很好的盈利. 由于我们不从Intel找人参与开发, 也没有侵犯它的专利, 它也从不找我们的麻烦.
  	  以后几年, 我们就从这里产生出七至八千万的利润, 进行一些新的产品开发, 包括486 CPU. Intel的策略, 就是用最新的工艺, 最好的设计快速提升CPU的性能, 我们追赶无望, 董事会下令终止项目.
  	  这是我过去几十年唯一没有看到完成的项目. 不过公司还是用其他开发出来的产品上市. 
  	  <br />今天世界上最快的CPU核就是x86, 有着微软窗口的生态圈和Oracle的数据库软件支持, 极难撼动. 十几年前大陆龙芯用MIPS指令集做出计算器芯片, 以后又不断改进, 一直过得很差.
  	  最主要的原因是, 既没有微软的生态圈支持, 又没有x86的性能, 自然没有人去用. 后来又有公司用ARM CPU做服务器, 也不成功. 
  	  原因也很简单, 它所用的CPU核所做出来的服务器芯片, 比起用Intel或AMD的服务器芯片性能差太远了, 自然Oracle不会去支持. 这些都是付出的学费. 可是能不付学费多好? 
  	  <br />要想进入这个市场, 必须要有性能最高功耗够低, 没有知识产权问题的x86 CPU核. 必须先作可行性研究. 这只要几个好的Computer Architect研究就行了. 
  	  先读一读AMD在2016年8月在Hot Chip Symposium发表它最新的x86核叫做ZEN. 这一个CPU核比现在Intel的都要好. 它使AMD打进了Intel垄断的服务器市场, 公司的股价也翻倍. 
  	  可以想见, 以后4年是这两家公司生死搏杀的时代, x86性能还会有很大的提升. 
  	  <br />要真正启动这个项目, 必须要有以下的先决条件. 缺一不行. 
  	  <ol>
  	  	  <li>了解ZEN改进性能的所有方法. 并且要有预案, 要超过ZEN很多, 因为我们谈的是五年后的对手.</li>
  	  	  <li>研究过去17年, 发给或是正在申请的Intel或AMD有关x86指令的专利. 若是有的话, 这就是致命的. 还有的是有关性能改进的专利. 这些需要想办法绕过去, 而且要做得更好. 
  	  	      假如芯片需要四年开发的话, 可以从17年缩短到13年.</li>
  	  	  <li>能否在三或四年后使用到和Intel一样好的制作工艺. 像是4纳米的技术. 4纳米的线宽相当于把18个硅原子排在一起. 差不多到生产工艺的极限了.</li>
  	  	  <li>计算器终端需要集成GPU以及南桥北桥. 服务器需要特别制作的DRAM和封装. 这方面需要寻找特殊的合作伙伴.</li>
  	  	  <li>x86指令匹配的验证方法.</li>
  	 </ol>
  </li>
</ul>
<p>结论.</p>
<ol>
  <li>生产线要集中. 第一类和第三类产品开发, 因为投资很大, 也只能每一种产品投资一个公司. 可是第二类产品的开发, 主要是看设计人员在哪里聚集, 就在哪里设置, 因为种类太多, 需要的人数也最多, 必须遍地开花.</li>
  <li>第二类产品相对好打, 因为都是固定目标Sitting Duck. 没有什么克服不了的技术难题, 需要的人很多, 资金的要求并不大, 投资回收的风险相对较小. 
      在这方面的投资可以持续增长, 更重要的是在这个过程中, 会培养大量的人才.</li>
  <li>第三类产品, 从经济回收来说是高风险. 不是最好的性能, 做出来也卖不掉, 而且以后3到5年间, 要求的性能还会快速提升, 因为Intel和AMD会拼死搏杀. 以后就会稳定下来, 因为生产工艺的改进, 已经到达极限.
      从架构上来改进CPU核也会到头. 那个时候我们看到的就是固定的标靶. 好打多了.</li>
</ol>
<p>做出和x86指令兼容的CPU, 那就只是芯片设计的问题. 否则就要提供数据库软件. 另外还有操作系统和生态圈, 市场上的风险又大多了. 
<br />我们可以这么想象, 商场如战场. 第一类, 第二类产品就是广大的农村小镇. 市场都比较单独, 壁垒低, 风险也比较低. 打掉一个就可以守住一个. 
第三类. 就是城市要塞. 对手兵精将广, 有吃不完用不完的粮食武器弹药的供应, 城墙在以后3到4年之间会越来越厚, 越来越高.
<br />可以很直白的说, 这就是一场新的人民战争, 全中国的芯片市场就是广大的人民群众, 整个战略就是乡村包围城市. 
<br />可是大规模开发第二类的产品需要很多人才, 这些人才从哪里来?  下一次讲的就是怎样建立和培养队伍. 遍地开花. 
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
