<?php require_once('php/_navchishin.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>如何从美国封杀中兴通讯的危机变成转机之八 -- 精兵简政防止弊端</title>
<meta name="description" content="美国封杀中兴通讯, 如何从危机变成转机之八? 精兵简政防止弊端. 宏宇提了一个非常重要的问题, 如何决定投资? 如何防止弊端? 至于税率, 我想还是应该由中美两国政府磋商决定.">
<?php EchoInsideHead(); ?>
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _ChishinLayoutTopLeft(); ?>

<div>
<h1>如何从美国封杀中兴通讯的危机变成转机之八 -- 精兵简政防止弊端</h1>
<h4>2018年5月21日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>宏宇提了一个非常重要的问题, 如何决定投资? 如何防止弊端? 至于税率, 我想还是应该由中美两国政府磋商决定. 
<br />一般寻找投资的人都会说他们做的项目是多么的了不起, 出来的产品可以改变世界. 大多数风险投资人也喜欢听这样的故事. 新的技术和新的市场表示更大的风险, 公司的价值很难估算, 公司的结构也比较复杂.
这类投资需要很有经验的风险投资人. 这里投资不太适合由政府做, 特别是在早期的阶段. 
<br />我们谈的是另外一个极端, 那些是已经有的芯片, 而且中国每年进口2000多亿美金. 我们希望省掉这些外汇, 同时希望以后不再被人用切断货源来卡住我们脖子. 
这些芯片用在哪里? 顾客在哪里? 每年有多少量? 用的是什么工艺? 芯片尺寸的大小, 芯片的成本, 芯片的卖价, 芯片的功能和性能都清清楚楚. 简单的说这些就是活靶子, sitting duck.
<br />只要能做得出, 成本更低, 功能更多, 速度更快, 功耗更低, 灵敏度更高等等, 就一定有市场. 
更何况国内的用户一定愿意支持国内的芯片公司来保证货源供应, 增加竞争来降低成本, 提供更好的技术支撑来造成各自产品的差异性. 客户有的甚至会愿意投资.
从客户的反应就可以知道这个市场到底有没有风险. 若是没有, 唯一剩下的就是如何把产品在预定的时间做出来, 而且成本和性能达标. 
<br />希望在产品开发出来以前, 公司员工只有技术人员. 一切开销降到最低. 公司创办人和基金会代表都在董事会上, 这样就不会有财务上的弊端. 
<br />我建议. 
</p>
<ol>
	<li>把半导体基金的投资项目对准在这一年2000多亿进口的芯片上.</li>
	<li>由技术团队提供技术解决方案, 基金投资管理人联系芯片使用厂家一起来, 听技术团队的报告. 由技术团队来解释, 他们为什么可以做得出来? 为什么可以做的更便宜? 性能可以更好? 需要多久时间? 多少研发经费? 
	    生产出来后有多大的市场? 多少利润? 等等.</li>
	<li>由以上的数据来决定投资的额度和技术股的价值.</li>
	<li>若是芯片的使用厂家也愿意参加投资, 这是最好的情况, 这就表示这个项目投资值得投资. 有其他的投资人制衡, 就可以保证资金不会被乱用.</li>
	<li>若是芯片使用厂家愿意使用, 这也是一个正面的信息, 作为衡量是否投资的标准. 投资基金会可以计算投资额, GDP的增加, 未来公司的利润和对系统厂商的保护来决定是否投资.</li>
	<li>公司刚成立到产品开发完成前只需要技术团队. 就在创业孵化园的隔间里上班. 由创业基金会每周派一名出了纳人员来准公司工作一天. 发薪水, 付各种开支, 员工雇用合同, 员工保险, 员工福利, 保密协议等等.</li>
	<li>基金会和公司创办人各占董事会一席. 若还有其他厂家愿意投资, 也可有一席.</li>
	<li>基金会投资并不表示这个公司就是个铁饭碗. 以后还要看产品的进度和市场的前景来决定是否继续投资. 希望尽量争取使用芯片的厂家们也来投资.</li>
</ol>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
