<?php require_once('php/_navchishin.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>如何从美国封杀中兴通讯的危机变成转机之七 -- 全国江山一盘棋</title>
<meta name="description" content="美国封杀中兴通讯, 如何从危机变成转机之七? 全国江山一盘棋. 5G射频芯片是中兴华为今后通往移动通讯和固网通讯WLL唯一没有拿在手中的咽喉要地. 拿下它基本上没有什么技术上的大难关要过.">
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _ChishinLayoutTopLeft(); ?>

<div>
<h1>如何从美国封杀中兴通讯的危机变成转机之七 -- 全国江山一盘棋</h1>
<h4>2018年5月19日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p>5G射频芯片是中兴华为今后通往移动通讯和固网通讯WLL唯一没有拿在手中的咽喉要地. 拿下它基本上没有什么技术上的大难关要过.
路别人已经走过了, 整个架构在<a href="20180513cn.php">第五章</a>所提到的ISSCC文章里是相当清楚的叙述出来的.
把它放在海思和展讯, 再调做过射频线路设计的精兵强将, 以最高优先的项目来处理, 这样成效更快, 争取两年拿下.
有问题可找国外专家做短期的咨询, 甚至电话咨询, 从ISSCC, JSSC, RFIC发表过有关文章的人找, 大学里的人更合适, 因为不会有知识产权的问题. 
<br />好友曹宏生寄份电邮给我. <font color=gray>该出山了, 别老在家里练气功.</font> 其实比我年轻, 对射频芯片设计更有经验的人多的是. 
李敖60年前那篇文章<a href="http://www.99lib.net/book/2216/66493.htm" target=_blank>老年人与棒子</a>, 我还是懂的. 在清风明月之下,  想一些别人没有时间没有心情想的问题, 说一些别人不说的大白话, 可能更起作用.
<br />说的凄惨一些, 从整个集成电路的市场来说, 今天整个中国除了海思和展讯等几个亮点之外, 已经成为美国, 日本, 韩国为首的八国联军的殖民地.
每年赚取2000亿美金的外汇, 对不听话的企业还会断水断供, 让它活不下去. 对做技术的人来说, 我们感到羞愧. 李鸿章当年签了很多屈辱的条约, 我一点都不怪他, 太难为他了. 
<br />为了培养本地的企业, 国家拿出了470亿美金作为半导体发展基金, 这是一件大好事. 可是在网上看到了一些老院士们的谈话, 心里又沉重起来. 
<br /><font color=gray>芯片有两大难关,  一个是生态圈, 一个是生产工艺.</font> 和外国相比, 我们的根基太薄弱了. 
<br /><font color=gray>芯片我们之所以不成功, 因为我们太想成功了. 我们满心希望在五年内就要把这个事情做出来.</font> 要了解厚积薄发的道理. 
<br /><font color=gray>把钱用在几个重点项目上, 不能遍地开花. 花钱少的项目, 自然有人会去做.</font>
<br />40年前我随团去了北京上海参观, 并且见到了当时清华大学, 四机部, 以及各半导体研究单位的负责人, 并且了解了他们的思维方式. 他们通常想到的是先抓纲, 纲举自然目张. 
我猜想他们指的项目, 大概是CPU以及半导体生产线, 只要集中力量办成几件大事, 其他的自然就水到渠成. 他们心目中所想到的困难, 就是办这几件大事遭遇的困难.
话不说清楚会让人一头雾水. 大多数的芯片完全不需要什么生态圈. 而且用国内已经有的工艺就可大量生产出来. 大多数的芯片从设计到量产, 根本就用不了五年. 
大陆的科技实力比台湾强得多, 为什么台湾可以出一个联发科, 其他的芯片公司也蓬勃发展, 而大陆还在叹科技实力不够? 不能把钱只花在几个大的重点项目上, 芯片五花八门, 当被卡脖子的时候, 少一样都可以致命. 
不要以为有了一条最先进的生产线就可以变成台积电, 它需要许许多多的芯片公司让它生产芯片, 这也是生态圈, 而这许许多多的芯片公司正是大陆今天所缺少的. 
<br />我可以了解老先生们在几十年久攻不下的项目前的挫折感和无奈感, 但是不能以偏概全, 认为所有的芯片项目都是这样. 事实上其他的方向更容易更快有成效, 更能让更多的人齐头并进, 形成一股洪流, 这就是所谓的生态圈.
<br />国家拿出470亿美金作为半导体发展基金是很不容易的. 大家对它的成效也有很高的期望. 
</p>
<ul>
	<li>第一. 希望用这笔钱发展各式各样的半导体核心技术, 以后不再受外国人控制. 更希望从这里, 发展出完整的半导体产业, 每年省下2000亿美金的外汇, 把中国的半导体市场, 从八国联军的殖民地解放出来.</li>
	<li>第二. 核心技术不能只是科研单位的一个研究项目. 它必须在公司的名义下, 以产品的方式体现出来. 透过市场竞争的机制, 不断自我改善, 这样才有生命力.</li>
	<li>第三. 这笔钱不能只用在几个重点项目, 像登陆月球, 大家只能坐着欣赏拍手叫好.</li>
	<li>第四. 核心技术有成千上万种. 必须要从学校教授和学生到企业全体科技人员的参与. 半导体基金会点燃创业的火种, 在全国各地在社会企业的支持下烧起燎原的大火.                                            
        这些核心技术开发基金进入学校就可以让教授的科研题目, 学生的论文题目和核心技术结合在一起. 企业和学校挂钩, 就可以早日提供和培养对企业急需的人才解决人才不足的问题.</li>
	<li>第五. 更重要的是选什么项目投资? 基金会可以用几个标准来衡量. 
		<ol>
			<li>这项投资对国家的GDP贡献有多大? 何时可以看到成效?</li>
			<li>这项投资的风险有多大? 什么时候会有回报? 回报率是多少?</li>
			<li>这项投资提供的零组件, 是否可以保护关键产业? 一个华为就至少抵得上三个台积电. 若能保护中兴通讯和华为, 应当列为优先.</li>
		</ol>
	</li>
</ul>                                           
<p>470亿美金是非常非常多的钱. 只要拿出其中10%作为芯片设计公司的风险投资基金, 就可以帮助好几百个芯片公司创业, 希望这里面有些变成联发科. 联发科今天股票的市值, 是最初投资时的32倍. 
每一年的盈利, 就赚回1.3个股本. 它不但带动了许多产业, 更是培养和锻炼了许许多多的半导体设计人才. 当时它成立的时候是政府提供的资金, 现在是全民都乐于投资的标杆企业. 
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
