<?php require_once('php/_navchishin.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>如何从美国封杀中兴通讯的危机变成转机之五 -- 普及版</title>
<meta name="description" content="美国封杀中兴通讯, 如何从危机变成转机之五? 昨天送出了一篇文章, 讲述如何救中兴通讯. 文章里的技术含量太高, 我想可能只有中兴通讯, 华为, 海思以及展讯的技术负责人才能看得懂体会. 这一篇是普及版, 是写给领导们和其他专业的技术专家们看的.">
<?php EchoInsideHead(); ?>
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _ChishinLayoutTopLeft(); ?>

<div>
<h1>如何从美国封杀中兴通讯的危机变成转机之五 -- 普及版</h1>
<h4>2018年5月13日</h4>
<h5>作者: <a href="indexcn.php">王继行</a></h5>
<p><a href="20180512cn.php">昨天</a>送出了一篇文章, 讲述如何救中兴通讯. 文章里的技术含量太高, 我想可能只有中兴通讯, 华为, 海思以及展讯的技术负责人才能看得懂体会.
这一篇是普及版, 是写给领导们和其他专业的技术专家们看的. 
</p>
<ul>
	<li>第一. 通讯市场分两大类. 一类是移动通讯. 信号从光纤到移动通讯基站. 再到手机. 另一类是固网通讯. 以后的主要趋势会是从光纤到无线本地环路, 再到各个家里的路由器, 再转到计算机电视电话电视盒里.</li>
	<li>第二. 中兴以及华为的问题是在5G移动通讯基站的射频部分设计是基于从美国和其他地方买来许多小规模射频集成电路拼起来的. 只要缺一样零件, 产品就生产不出来. 
		更糟糕的是美国的TI, ADI在设计5G移动基站射频部分的大规模集成电路, 一旦出来, 中兴华为现在的移动基站系统, 就完全过时了. 即使能够拿到货, 脖子永远卡在人家手里.</li>
	<li>第三. 唯一的根本解决之道, 就是自己要设计5G移动基站射频部分的大规模集成线路芯片. 
		<br />我研究过, 这种芯片要求的工艺不高, 只要28到45纳米CMOS就行了. 现在手中有的CAD系统就可以. 
		也不需要像操作系统那样的生态圈. 绝大部分的设计文章都已经发表过了, 属于公开的资料. 用的架构也出现在20年前的专业书籍里, 也没有侵犯专利的问题. 
		这种芯片可以光明正大, 清清白白的设计出来. 专家们也很多, 很好找. 只要不从做5G射频芯片公司里找人, 就不会有盗取别人商业机密的问题. 我估计只要四五个专家们带领一些工程师, 和学校的学生们. 就可以把这个芯片做出来.
		总投资额不会超过2000万美元. 
		<br />虽然在去年底, 5G专家组又在视频上加了新的课题, 用相控数组雷达的技术把天线的波束实时对准在移动的用户身上. 这种技术中国军方早已经用在雷达上面. 只是把它做小做便宜罢了. 问题不大.</li>
	<li>第四. 只要第三所谈到的芯片一做出来. 这个做射频集成线路芯片的公司立刻就成功了. 同时中兴和华为所面临的困局就完全解开了.</li>
	<li>第五. 以前国内失败的经验太多了, 一提起芯片就怕. 其实关键是做什么? 怎么做? 关键的是选重要的而且又能做成的去做. 这就像打仗一样. 没有飞机坦克, 就无法打开库尔斯克战役, 可是难道不能打平型关战役?
		不能打孟良崮战役? 不能打锦州战役? 
		<br />5G移动基站射频集成电路芯片, 就是锦州. 不把这个套在脖子上的绳索拿下, 不被勒死, 也会被永远敲竹杠.</li>
</ul>
<p>为了不让议题混淆, 另外一个很重要的芯片, 无线本地环路就以后再说了. 那是用在固网通讯上的. 我认为市场的发展, 会比5G移动通信还快. 
而且非常适合中兴华为现有的顾客群. 一带一路上的国家, 以及非洲, 拉丁美洲都非常需要它. 
</p>
</div>

<?php _ChishinLayoutBottom(); ?>

</body>
</html>
