<?php require_once('php/_navlaosun.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>雪球唐朝虚幻的选股信念</title>
<meta name="description" content="人民群众对于某些东西的特殊信念(业绩要增长, 市盈率不要高等等等等)是完全经受不住考验的. 人民群众总是愿意去相信【听!起!来!很!有!道!理】的东西远远胜于去相信事实.">
<link href="/common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _LaosunLayoutTopLeft(true); ?>

<div>
<h1>雪球唐朝虚幻的选股信念</h1>
<p>2017年6月24日
<br />作者: <a href="indexcn.php">孙老湿</a>
<br />雪球<a href="https://xueqiu.com/daniel" target=_blank>唐朝</a>以其坚定的价值投资获得了广泛的支持, 并且也多次公开了他的选股标准, 如下图:
<br /><img src=image/20170624/tangchao1.jpg alt="Tangchao weixin screen shot 1" />
<br />按照这个标准筛选出来的股票未来表现到底如何呢? 我们今天就来检验一下历史数据, 假装是唐朝回到了3年前和6年前.
如下图, 我们选择两个时间段分别来观测, 一个是2011年-2014年, 另一个是2014年-今天, 选择这两个区间段很容易理解, 因为一个是牛市一个是熊市, 可以排除大盘的影响, 为什么选择3年的期间的, 因为唐朝的策略是未来3年赚1倍.
<br /><img src=image/20170624/market.jpg alt="Chinese stock market" />
<br />让时间倒流回到3年前, 我们按照唐朝上文中提到的标准利用Choice软件进行筛选股票. 如下图, 对于2014年-2017年阶段, 唐朝的选股标准是:
<br /><font color=grey>四年前上市</font> - 2010年上市
<br /><font color=grey>连续三年ROE>15</font> - 2011~2013年 ROE>15 等等
<br /><img src=image/20170624/choice.jpg alt="Choice market data" />
<br />根据上述标准筛选完股票后, 我们如何考察业绩呢? 唐朝的标准在这里:
<br /><img src=image/20170624/tangchao2.jpg alt="Tangchao weixin screen shot 2" />
<br />也就是说三年内赚一倍, 是唐朝的要求, 根据这个标准, 最简单粗暴的方法就是, 我们按照从唐朝2014年选股前一天的股价作为起始价格, 在未来三年内的任何出现的最高价达到了初始价格的2倍, 我们就算成功了. 统计结果如下:
<br /><img src=image/20170624/excel1.jpg alt="Excel data 1" />
<br />在<font color=grey>四年前上市</font>的1839家公司里面, 满足唐朝选股标准的个股一共有108个, 而这108个标的在未来3年的区间最高价有100只达到过初始价格的2倍, 简单点说, 成功率就是: 92%!!
<br />这个结果是否会让您热血沸腾呢? 我们不忙着先下结论, 我们对照看看如果某个同一天的散户, 他没有按照唐朝的标准选股, 只是把上市时间提前几个月, 目的是剔除刚上市新股暴涨数据失真, 其他一律不考虑, 会怎样呢? 结果如下:
<br /><img src=image/20170624/excel2.jpg alt="Excel data 2" />
<br />真相让人大吃一惊: 散户不做任何筛选的结果是成功率高达95%!!! 完胜唐朝的貌似周到细致的删选.
<br />如果唐朝按照赚一倍就跑的策略的话, 那么唐朝的最高收益就是1倍, 那我们统计一下这些成功标的的区间涨幅分布: 
<br /><img src=image/20170624/excel3.jpg alt="Excel data 3" />
<br />根据上图, 唐朝策略成功的100只股票平均最高收益是3.22而散户的平均最高收益是3.91倍, 同样中位数散户也大幅度高于唐朝, 最小/最大值的比较也很有意思.
<br />看完上述结果, 我们很快会有一个猜测, 2014~2017年间, 由于15年的大牛市, 鸡犬升天, 所以价值投资没有战胜散户也许是大盘的原因, 这听起来非常有道理, 那我们来看看2011~2014年的熊市统计, 直接上结果:
<br /><img src=image/20170624/excel4.jpg alt="Excel data 4" />
<br />结果是否令你非常震惊? 熊市阶段, 唐朝策略的成功率仅有6.9%, 而散户策略的成功率竟然高达15.1%!! 再统计一下所有当初选中的标的最终结果的对比
(与上面那个14年的图不一样, 前面那个图是成功者的统计, 下图是买入前符合要求的标的的最终结果): 
<br /><img src=image/20170624/excel5.jpg alt="Excel data 5" />
<br />除了最小值散户败于唐朝策略, 其他数据都优于唐朝策略, 那么这个最小值0.8999怎么解读呢? 这是某个个股买入第二天就跌停, 从此再没有涨回来过.
<br />难道唐朝那些看起来很有道理的筛选标准什么意义都没有吗? 我们再想想遗漏了什么?
根据每个炒股韭菜的<font color=green>常识</font>, 我们似乎有印象, 价值股在牛市未必涨的猛, 但是优点是熊市跌的少, 亏得少就是赚的多啊.
这听起来非常有道理, 那我们再考察一下, 唐朝策略个股和散户策略在2011-2014的熊市阶段的回撤表现如何, 我们用区间历史最低价除以初始价格, 结果如下:
<br /><img src=image/20170624/excel6.jpg alt="Excel data 6" />
<br />我们很遗憾的发现: 唐朝策略除了最小值略好于散户策略, 在平均值/中位数等一律跑输散户.
对于散户策略最大值2.28怎么解释呢? 没道理区间最低值比初始值高2倍啊, 这个特例的原因是某个个股在买入时间时处于停牌, 复牌后直接涨几倍再没有跌回去的原因.
在回撤方面, 唐朝策略的表现在整体上也不如散户.
<br />这个看起来没有天理啊, 唐朝策略<font color=green>听起来</font>如此有道理, 为何实际结果如此不堪呢? 一定是我们回测有什么东西没有想到, 让我们再好好想想,再看看唐朝是怎么说的: 
<br /><img src=image/20170624/tangchao3.jpg alt="Tangchao weixin screen shot 3" />
<br /><font color=greay>三年后15倍市盈率卖出赚一倍</font>, 这句话怎么理解呢?
如果你今天7.5倍市盈率买一只股票, 三年内在15倍市盈率卖掉可以赚1倍, 但是显然这个股票的业绩并没有增长, 而唐朝显然不是这个意思.
他的意思用一个例子来讲就是: 今天15倍市盈率, 三年内还是15倍, 但是我赚了一倍, 这怎么做到的呢? 很简单, 业绩增长了1倍嘛, 对于初始市盈率超过15倍的, 其业绩增长要超过1倍才行.
<br />那我们计算一下, 3年业绩最低限度增长一倍的年化增长是多少, 答案是: 26%
<br />我们再理一下思路: 如果某个时间点根据唐朝策略筛选出来的个股, 如果未来3年业绩真的增长了一倍, 年化26%, 那么这些个股应该说就是完全符合唐朝策略的个股了.
我们上述的比较都没有考虑筛选出来标的未来的业绩, 我们一起来看看这些通过筛选也最终业绩达标的公司实际表现到底如何, 请看图:
<br /><img src=image/20170624/excel7.jpg alt="Excel data 7" />
<br />在2011-2014年期间, 唐朝策略在所有A股中筛选出来的个股数量有87只, 这87只个股中共有31只股票在未来3年(2013-2016)的业绩达到了涨一倍的要求, 这些完美符合唐朝策略的31只股票, 其区间最高涨幅的表现基本也没有战胜散户.
<br />这很让人泄气是不是? 我们最后一线希望来看看这些通过筛选业绩也好的股票他们是否低于住了回撤呢?
<br /><img src=image/20170624/excel8.jpg alt="Excel data 8" />
<br />非常遗憾的发现, 唐朝完美策略(未来业绩也符合预期)的回测比散户的回撤表现也更糟糕, 回撤幅度在平均值和中位数方面都不如散户策略.
<br />按理说唐朝策略就算不行, 那也应该跟散户策略不分上下吧, 怎么可能很多时间还不如散户呢? 我能想象出来的一个合理解释是: A股价值投资驱动力不如投机驱动力影响大, 这是一个不太好实证的猜想.
<br />但是大家都知道唐朝的业绩是非常好的, 我个人对这一点也毫无置疑, 这怎么解释呢? 事实上,我们知道唐朝并不会在符合他筛选标准的个股上就会投资, 而是会进一步分析.
上述结论不能证明唐朝是个骗子, 唐朝的投资策略是无效的, 但是上述结论证明了很重要的一点:
<br />唐朝策略的选股的那些量化指标与标准, 以及未来业绩达标这些看起来很重要很核心的东西, 都是无效的! 这些统计结果就证明了一个现象: 
<br /><b>人民群众对于某些东西的特殊信念(业绩要增长, 市盈率不要高等等等等)是完全经受不住考验的.
人民群众总是愿意去相信【听!起!来!很!有!道!理】的东西远远胜于去相信事实, 这不仅仅限于股市, 广泛存在于人民群众所有的生活的方方面面, 这就是本文的最终结论. </b>
<br />PS: 唐朝是个旗帜鲜明反缺乏实证的中医的人士, 中医粉丝坚信中医有效和唐朝粉丝坚信唐朝策略有效之间最大的相似之处是什么呢?
答: 信念.
尽管我们看到散户的统计指标一点都不比唐朝策略差, 但是当面临同样回撤的情况的时候, 唐朝策略的价值投资韭菜们对未来的坚信程度会远远高于散户.
我相信这是价值投资韭菜回报率高于散户的一个重要原因, 也是价值投资韭菜更能在现实中凭借着信念坚守到2倍, 而散户韭菜更多会死撑到大回撤的时候投降逃跑 , 下图是最好的一个描述:
<br /><img src=image/20170624/mymarket.jpg alt="My stock market" />
</p>
</div>

<?php _LaosunLayoutBottom(true); ?>

</body>
</html>
