<?php require_once('php/_entertainment.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>大道至简从上证大型国有股获利</title>
<meta name="description" content="在Qualcomm同意现金收购CSR和中国国航(SH601111)罕见涨停的幸运日总结2年多来自己谨小慎微的A股市场大型国有股买卖获利方案. 附加分级A, 华宝油气和XOP交易规则.">
<link href="../../../common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _LayoutTopLeft(true); ?>

<div>
<h1>大道至简从上证大型国有股获利</h1>
<p>2014年10月16日
<br />昨天是我的幸运日. Qualcomm同意现金收购<a href="20090219cn.php">CSR</a>的新闻让我这唯一的英国股票上涨了30%. 而中国国航(<?php EchoMyStockLink('SH601111'); ?>), 目前我唯一重仓的A股, 在昨天拉了个涨停.
<br />我从2000年开始在美国市场上买卖股票, 一直都是一个失败的<a href="20111112cn.php">投资</a>. 我总是在股票刚开始涨的时候就很快卖掉, 然后看它一路往上涨很久, 而会把严重亏损的股票一直持有很多年.
今年6月<b>自愿</b>放弃我的美国绿卡后, 因为没有了交税的心理负担, 我一直在考虑卖掉最近几年上涨了很多的CSR股票. 但是过去的经历让我总是觉得这很可能又会是另外一个错误的大决定. 最后, 感谢Qualcomm替我做出了选择.
<ol>
  <li>2012年我开了A股账户. 跟美国单一笔的交易费用不同, 中国的券商按照交易金额比例收费. 比如我开户的<a href="http://bocichina.com" target=_blank>中银国际</a>收0.075%, 最低5块.
      对我来说这是个好的开始, 从此我改变了交易风格, 停止大笔交易, 定下了第一条交易规则:
      <br /><b>只做小交易. 6.66元以上的股票每次交易1000股. 价格在3.33到6.66之间的每次交易2000股. 2.22到3.33之间的每次3000股.</b>
  <li>2000年的时候我有一阵子天天都狂买进卖出. 结果不光赔了钱, 第2年报税的时候又被折磨了一遍, 一条条的输入每个卖出记录. 后来我就学会了更加耐心的交易.
      美国市场上我可以下个单然后3个月不去管它, 不过国内只能当天有效. 依此定第2条:
      <br /><b>每天刚过午夜后下单, 白天交易时段不再更改.
      根据每日更新的<a href="http://vip.stock.finance.sina.com.cn/q/go.php/vDYData/kind/znzd/index.phtml" target=_blank>新浪</a>数据, 在支持位价格下买单, 在阻力位下卖单.</b> 
  <li>因为这么多年来都没有培养成功我的止损习惯, 我决定只操作A股的大型国企股票, 这样市场不好的时候我一样可以安心持有. 我用上证指数指导第3条规则:
      <br /><b>上证指数每上升100点卖出5万股票. 因为我目前处于逐步建仓阶段, 每下降100点增仓5-10万.</b>
  <li>我用第4条规则锁定利润:
      <br /><b>对单独某个股票, 当上证指数(规则3)上涨的时候, 如果阻力位(规则2)的价格比最后一次买入的价格高5%就下卖单(规则1), 当阻力位不变或者上升时持续卖出, 直到总仓位达到规则3的标准.
      反之当上证指数下降的时候, 如果压力位的价格比最后一次卖出的价格低5%就下买单, 当压力位不变或者下降时持续买入, 直到总仓位达到规则3的标准.</b>
</ol>
<br />基于以上规则, 我希望能带来平均每年10%的收益, 但愿未来能够成功.  
</p>
<p><font color=grey>Just like I'd never gone, I knew the song. <a href="../../favoritecn.html#laislabonita">La Isla Bonita</a> <i>Madonna</i></font></p>
<p><img src=../photo/20141016.jpg alt="Screen shot of my Chinese A stock portfolio as of Oct 16 2014" /></p>
<p><font color=grey>当你为朋友立传时, 一定要做得像你在为他报仇雪恨那样. <a href="../../favoritecn.html#flaubertsparret">福楼拜的鹦鹉</a> Flaubert's Parret by <i>Julian Barnes</i> <i>石雅芳</i>译</font></p>

<h3><a name="2014">2014</a>总结</h3>
<p>2015年1月1日
<br />2014年买入47笔, 卖出85笔, 总交易132笔, 总交易金额大约130万. 5月持仓最高约48万, 年末持仓最低约21万. 最后2个月上证指数涨得实在太快, 完全没有机会按照我的规则卖出. 否则早卖光了.
全年账面盈利增加约17万, 按照年初计划的100万资金投入, 算上国债逆回购和利息收入, 全年收益率大约21%. 
<br />2015年继续计划100万资金投入, 交易规则不变, 继续上证指数每上升100点减仓5万股票. 每下降100点增仓5万. 按照目前的指数和持仓调整参考仓位公式为<font color=grey>(22.5-5*(上证指数-3200)/100)*10000</font>.
</p>

<h3><a name="A">分级A交易规则</a></h3>
<p>2015年7月12日
<br />伴随着全民借钱炒股的疯狂, 最近几个月来对分级基金的讨论日益火爆. 各种申购/赎回/上折/下折套利让人眼花缭乱, 我觉得麻烦, 一直没有特别关注. 
<br />一个多月前上证指数站上5000点那天后跟老孙的几个朋友吃饭, 席间谈论的当然都是必破6124点的股票市场. 老孙听说我绝大部分人民币都放在银行买收益率5%的理财产品后, 大力推荐我购买当时折价已经在20%以上的分级A基金.
<br />基于对老孙学习精神的信任, 我赶紧恶补了一下. 发现折价20%以上的分级A的确是个好东西, 收益率比银行理财高, 风险却比银行理财低, 显然过去三年中我低估了人民币的无风险收益.
<br />考虑到分级A操作会比我的大型国企股票要频繁得多, 我在<a href="http://www.glsc.com.cn" target=_blank>国联证券</a>网上开了个0.025%, 最低5块交易费用的新帐户. 
本来是想联系中银国际降低佣金的, 无奈股市太火爆, 电话永远打不进去, 根本联系不上. 
<br />然后开始逐步杀入, 一个月简单买入卖出操作下来, 在分级A上的钱居然已经赚了相当于1年多的利息. 高兴之余今天总结一个大道至简的分级A交易规则:
<ol>
  <li>不参加母基金的申购, 也尽可能不参加母基金的赎回, 而是在市场上直接买卖. 同时尽量不参加上折和下折. 
  <li>根据当日分级A行情, 圈定所有折价20%以上的, 选择尚未持有的品种, 按照折价最多的依次买入. 每个品种每次3万股, 总额大约24000左右, 满足最低5块的交易费用. 
  <li>分级A上升时, 每笔买入盈利超过5%以上的时候卖出. 返回上一步, 直到所有折价20%以上的品种都已经持有为止.
  <li>分级A下跌时, 单个品种每下跌2%以上的时候补仓3万股. 
  <li>最小交易价格单位为1分钱, 不下0.795这种单.
</ol>  
<br />今年以来上证指数大幅波动, 按照它调整仓位成了个笑话, 调仓规则和公式早已经统统弃用. 中国打头的股票在持续不断的上升过程中几乎已经卖光.
但是因为仓位太低, 靠国企股票估计难维持去年整体21%的收益率, 希望分级A能够助一臂之力. 
<br />因为分级A可能会替代掉银行理财的地位, 去掉100万的上限资金限制, 看在我的交易规则下能够最多买到多少.
</p>
<p><font color=grey>中间是勤奋好学而且乐于分享的老孙. </font>
<br /><img src=../../groupphoto/customer/laosun.jpg alt="Li Jing, Sun Yanhong and me in central park, NYC." /></p>

<h3><a name="SZ162411">华宝油气</a>和XOP套利交易规则</h3>
<p>2015年8月15日
<br />分级A的交易规则定完后就再也没有碰到买入的机会. 大家都说7月8号那种分级A集体跌停的机会百年难遇, 看来我这辈子再也碰不到了. 
<br />炒股的好处不只限于分级A, 其实这一年来给我印象最深的是看<?php EchoXueqieId('3037882447', '云蒙'); ?>来回在港股和A股之间买卖招商银行的股票, 哪边低就持有哪个. 用不到2百万的本金, 1年交易了几个亿, 稳稳赚了几百万.
这种锚定一个标的来回交易套利的模式值得学习. 
<br />Qualcomm收购CSR的现金下周终于有希望能到账了. 本来宣布的是6月底, 结果中国政府一直拖到快7月底才批准这个收购. 美国/英国/韩国/日本/印度都在此之前批准了, 而可爱的台湾一开始就干脆放弃了这项权利. 
由于我的美股交易依旧毫无章法, 我其实有点发愁怎么处理这笔钱. 最省心的就是直接都买成Qualcomm股票, 然后接着放着不去管它.
反复考虑后, 我还是决定效仿云蒙. 锚定标普油气开采指数^SPSIOP的2个基金, 用我低交易费用的国联证券账户, 在A股的华宝油气(<?php EchoMyStockLink('SZ162411'); ?>)和美股的<?php EchoMyStockLink('XOP'); ?>之间来回交易套利.
建立简单规则如下:
<ol>
  <li><b>NYMEX原油这一轮价格在60美元以下时执行此规则.</b> 去年底我开始抄底原油和相关股票的ETF, 碰到的还是老问题, 抄底的时候总抄在半山腰, 涨一点就忍不住卖光了. 希望通过套利交易能够克服我的持仓恐惧症.
  <li><b>折价和溢价计算按照已经发生的原则.</b> 我会根据每天A股开盘前官方发布的<a href="../../res/sz162411cn.php">华宝油气净值</a>调整软件的计算公式参数.
  <li><b>华宝油气价格在0.50以下时, 每次交易5万股. 价格在0.50到0.67之间时, 每次交易4万股. 价格在0.67到1.00之间时, 每次交易3万股.</b> 满足最低5块的交易费用.
  <li><b>华宝油气每累计交易16万股时, 对应XOP一次交易400股.</b> 原则上还是不做大交易, 不过兼顾把固定费率交易的美股平均费用比例拉低到国联证券同一个数量级水平.
  <li><b>华宝油气溢价超过1.5%时分批每次提高0.1分卖出, 在XOP不高于上个收盘价的条件下选择一个短期均线值买回相应份额</b>. 1.5%相当于华宝油气申购费率.
  <li><b>华宝油气折价超过0.5%时分批每次降低0.1分买入, 在XOP不低于上个收盘价的条件下选择一个短期均线值卖出相应份额</b>. 0.5%相当于华宝油气赎回费率.
</ol>
<br />华宝油气虽然跟踪的是美国的页岩气公司股票, 但是它喜欢跟A股涨跌, 而且涨的时候往往会溢价, 而跌的时候总会折价. 开始我一直觉得是A股钱多人傻, 买卖的人根本不知道自己买卖的是什么标的. 
但是后来我进入了第二层境界考虑这个问题, 由于A股的涨跌直接影响大宗商品的价格, 华宝油气跟A股短期走势一致也是可以理解的.  
今天老孙在微信上炫耀他读高中的儿子这个暑假2个月用18万本金在<a href="#A">分级基金</a>上套利总共获利2.5万人民币. 我于是进入了<font color=lime>看山还是山看水还是水</font>的第三层境界: A股市场钱多人傻, 可能的确是套利交易者生存的好地方.
</p>

<h3><a name="2015">2015</a>总结</h3>
<p>2016年1月3日
<br />2015年总交易金额大约600万, 比<a href="#2014">2014</a>年多了4倍. 8月持仓最高约65万, 6月持仓最低约17万, 总体平均持仓比2014年略高.
全年账面盈利增加约6万, 按照年初计划的100万资金投入, 算上国债逆回购和利息收入, 全年收益率大约9%, 大幅低于2014年的21%.
<br />大约50%的交易金额是6-8月<a href="#A">分级A</a>贡献的, 今年的6万纯盈利也基本上来自于这段时间300万的分级A交易.
<br />大约40%的交易金额来自<a href="#SZ162411">华宝油气</a>和XOP的套利交易, 体现在全年收益上是华宝油气亏损5万.
<br />剩下10%的交易金额主要是我的大型国企中国国航, 中国石化, 中国联通和中国银行等交易, 受益于上证指数今年10%的上涨, 盈利5万左右.
<br />2016年计划继续100万的投入, 主要用于华宝油气和XOP的套利交易, 向云蒙女神学习, 继续加大交易量, 增加套利效率. 同时逐步放弃中国国航和中国联通等比H股贵太多的A股的交易.
</p>

<h3>华宝油气和XOP套利更新</h3>
<p>2016年7月16日
<br />华宝油气和XOP套利搞了差不多一年, 现在的操作跟一年前已经有很大的不同. 好记性不如烂笔头, 记录一下这期间的变化和目前的状态. 
<br />交易费用下降了, A股新开了万分之2佣金的华泰证券账户, 最近客户经理还把我的基金交易佣金又调低到了万分之一, 而且它家基金交易还没有最低5块的限制.
美股跟随云蒙女神新开了IB账户, 每股交易费用0.005美元, 最低1美元, 相当于最少收200股的交易费用.
<br />总交易金额迅速增加, 多到我不胜其烦, 干脆结束了原来用Excel统计交易量的栏目. 
<br />花在交易上的时间也是急剧增加, 已经让我相当怀疑这么做有没有必要了, 还是要尽可能简化交易模式, 避免盯盘. 另外要赶快把IB的API搞起来, 自动交易美股部分. 
<br />更新华宝油气和XOP套利规则如下:
<ol>
  <li>华宝油气每次交易8万股, 对应XOP 200股.
  <li>XOP全部采用<a href="20150818cn.php#sma">均线</a>价格交易, 不做盘前盘后交易.
  <li>华宝油气溢价时, 在最接近的XOP均线上开始分批每次提高0.1分卖出.
  <li>华宝油气折价时, 在最接近的XOP均线上开始分批每次降低0.1分买入.
  <li>赔钱的买卖坚决不做, 每笔华宝油气或者XOP的交易都要保证是基于以前的某笔买卖赚钱的, 否则坚决不交易.
</ol>
<br />总体来说, 现在华宝油气的交易者群体精明了很多. 跟A股无由头涨跌的时候越来越少, 更多的是跟白天<a href="../../res/clcn.php">美油期货CL</a>价格波动. 也许不应该把我现在这个操作称为套利了. 
</p>

<h3>留得青山在不怕没柴烧 - <a name="2016">2016</a>总结</h3>
<p>2017年1月1日
<br />2016年几乎每天都在交易, 交易金额多得我在5月份就放弃统计了. 高频交易的结局却很悲惨. 全年人民币赚了228321.46, 美元亏了37815.39, 总体亏损人民币34003.89, 全年收益率大约-2%.
<br />整个2016年只有2个交易日总体持仓盈亏是赚钱的. 由于持续的亏钱导致心理崩溃好几次, 而在每次心理崩溃后都会暴饮暴食, 之前3年没有发作痛风在2016年发作了好几次, 让人生更加黑暗无比.
<br />年初的时候美油CL跌破40美元大举买入3倍杠杆的UWTI抄底, 一路接飞刀接到30美元弹尽粮绝. 眼看它跌到26, 反弹到33, 换月升水近2美元后再次跌回26, 当时觉得美元要赔光了, 吓破胆子后, 再次反弹到33割肉, 留下31111.66美元的亏损.
然后的剧情是CL一路上涨, 最高差不多到了55美元. 而我是再也不敢交易3倍杠杆的东西了. 
<br />上半年美股跌得比较厉害, 原来用<?php EchoMyStockLink('SH'); ?>做空美股对冲华宝油气和XOP的多仓作用太小, 美股反弹后就开始了VXX的自杀之旅. 一开始运气好, 没2个月就碰上了英国脱欧, VXX一度获利6000多美元.
然后美股一路新高, 到了11月临近美国总体竞选前实在崩溃了, 不仅把之前赚了赔了回去, 割肉后还留下大约8000美元亏空. 
Trump当选后美股又开始涨, 不死心继续买VXX, 再次崩溃, 12月30号最后一个交易日再次彻底割肉, 留下总共16063.35美元的亏损. 发誓赌咒再不碰它了, 回归SH空美股对冲.
<br />写<a href="#2015">2015</a>总结时觉得最靠谱的华宝油气和XOP的套利交易, 全年下来也讽刺得很. 看上去是人民币赚了144989.38, 美元赚了12026.69.
但是如果在2015年结束的仓位上完全不交易, 则会赚228480人民币和17920美元. 套利一整年收获无数多巴胺, 却少赚35%的真金白银.
<br />全年唯一得意之处, 是在美股中石化价格高于A股中国石化的阶段空<?php EchoMyStockLink('SNP'); ?>多<?php EchoMyStockLink('SH600028'); ?>, 套利赚了点小钱不说, 
SH600028的门票打中了一个新股<?php EchoMyStockLink('SH603060'); ?>, 赚了37219.01人民币.
<br />2017年继续打新, 继续华宝油气和XOP套利, 同时看能不能多发掘其它类似套利途径. 坚决不再交易美股期货相关的ETF和杠杆ETF. 
</p>

<h3>采菊东篱下悠然见南山 - <a name="2017">2017</a>总结</h3>
<p>2017年12月30日
<br />说多了都是泪. 先上图记录一下.
<br /><img src=../photo/20180102.jpg alt="Screen shot of woody's 2017 stock profit data" />
<br />在跟寒号鸟一样喊了好几年<font color=grey>同是天涯沦落人走投无路来炒股</font>后, 2017年算是我最接近全职投资的一年.
全职不光意味着跟前些年一样整天没有别的鸟事可做, 还意味着今年所有的钱都放到股市中来赌博了. 虽然操了卖粉的心, 却连白菜钱都没有赚到.
美元人民币一起本金大约350万人民币, 一年下来只有16万人民币的利润, 不到5%的收益率, 放银行闭着眼睛买理财一样能拿这么多钱. 
<br />年初在<?php EchoXueqieId('3724438413', '爱吐槽的骑姐'); ?>的感召下弄了几个HA价格差不多的A股门票打新, 很快就跟去年一样人品爆棚中了一个新股<?php EchoMyStockLink('SH603089'); ?>赚了3万多.
紧接着所有的门票就在我的持股恐惧症下卖飞了, 从此跟A股成了路人, 愧对从去年开始一直督促我打新的人生导师<?php EchoXueqieId('5421738073', 'thanous'); ?>. 
<br />在鼓吹XOP和华宝油气跨市场<a href="#SZ162411">套利</a>2年多后, 今年终于靠<?php EchoXueqieId('6706948861', 'zzzzv'); ?>的不懈教诲克服了唐氏综合症的天生迟钝, 在6月份开始了申购套利, 9月份第一次尝试了赎回, 并且在12月开始了赎回套利.
全年靠这个套利增加了大约12万人民币和1.5万美元的利润, 折算成人民币一共约22万收益. 这点小钱虽然比不上<?php EchoXueqieId('2950181900', '没钱老板'); ?>赚得多, 
但是多半比一直坚持学习巴菲特持股不动的<?php EchoXueqieId('6900406005', '大熊宝宝--林某人'); ?>收益好. 
<br />在开始搞申购和赎回后, 由于漫长的人民币等待周期, 美元一下子显得多了出来, 不甘寂寞的我在9月份尝试了SINA和WB的套利, 在我的均线亏钱大法下很快演变成了一场裸空SINA的噩梦.
冷眼旁观的zzzzv嘲笑我说: 见过空WB多SINA的, 也见过空SINA多WB的, 裸空<?php EchoMyStockLink('WB'); ?>的也有, 就是没见过裸空SINA的. 大概是受不了我的愚钝, 后来他默默退群了.
最后我空的<?php EchoMyStockLink('SINA'); ?>在一个半月后终于不赔钱退出, 再不敢自作聪明了
<br />而空标普500的噩梦则持续了一整年, 贡献了我今年所有的亏损. 本来想在昨天最后一个交易日彻底清空止损的, 但是没有下手, 主要还是不知道止损后多出来的十多万美元拿来干什么好.
想想当初夸下了海口, 出去的美元就没有打算再回来, 总不能现在打自己的耳光换成人民币吧！
<br />2017年只剩下明天最后一天, 让我最满意的是, 忍住今晚不吃, 看样子今年能成功避免痛风发作. 得意之余, 年终总结的题目便从去年的<a href="#2016">留得青山在不怕没柴烧</a>改成了<font color=blue>采菊东篱下悠然见南山</font>.
2018年继续大隐隐于市的隐居生活, 早日止损空标普, 继续套利的圣杯, 争取净赚个10%回来, 有望首次结束多年来坐吃山空的窘境. 
</p>

</div>
                                  
<?php _LayoutBottom(true); ?>

</body>
</html>
