<?php require_once('php/_20141016.php'); ?>
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8">
<title>从上证大型国有股票获利</title>
<meta name="description" content="在Qualcomm同意现金收购CSR和中国国航(SH601111)罕见涨停的幸运日总结2年多来自己谨小慎微的A股市场大型国有股买卖获利方案.">
<?php EchoInsideHead(); ?>
<link href="../../../common/style.css" rel="stylesheet" type="text/css" />
</head>

<body bgproperties=fixed leftmargin=0 topmargin=0>
<?php _LayoutTopLeft(); ?>

<div>
<h1>从上证大型国有股票获利</h1>
<p>2014年10月16日
<br />昨天是我的幸运日. Qualcomm同意现金收购<a href="20090219cn.php">CSR</a>的新闻让我这唯一的英国股票上涨了30%. 而<?php EchoMyStockLink('SH601111', '中国国航'); ?>, 目前我唯一重仓的A股, 在昨天拉了个涨停.
<br />我从2000年开始在美国市场上买卖股票, 一直都是一个失败的投资. 我总是在股票刚开始涨的时候就很快卖掉, 然后看它一路往上涨很久, 而会把严重亏损的股票一直持有很多年.
今年6月<b>自愿</b>放弃我的美国绿卡后, 因为没有了交税的心理负担, 我一直在考虑卖掉最近几年上涨了很多的CSR股票. 但是过去的经历让我总是觉得这很可能又会是另外一个错误的大决定. 最后, 感谢Qualcomm替我做出了选择.
<br />2012年我开了A股账户. 跟美国单一笔的交易费用不同, 中国的券商按照交易金额比例收费. 比如我开户的<a href="http://bocichina.com" target=_blank>中银国际</a>收0.075%, 最低5块.
对我来说这是个好的开始, 从此我改变了交易风格, 停止大笔交易.
<br />2000年的时候我有一阵子天天都狂买进卖出. 结果不光赔了钱, 第2年报税的时候又被折磨了一遍, 一条条的输入每个卖出记录. 后来我就学会了更加耐心的交易.
美国市场上我可以下个单然后3个月不去管它, 不过国内只能当天有效, 所以我现在都是每天刚过午夜后下单, 白天交易时段不再更改.
<br />因为这么多年来都没有培养成功我的止损习惯, 我决定只操作A股的大型国企股票, 这样市场不好的时候我一样可以安心持有. 
<br />希望能带来平均每年10%的收益, 但愿未来能够成功.  
<br /><font color=gray>当你为朋友立传时, 一定要做得像你在为他报仇雪恨那样. -- 福楼拜的鹦鹉</font>
<br /><img src=../photo/20141016.jpg alt="Screen shot of my Chinese A stock portfolio as of Oct 16 2014" />
<br /><font color=gray>Just like I'd never gone, I knew the song. -- La Isla Bonita</font>
</p>

<h3><a name="2014">2014</a>总结</h3>
<p>2015年1月1日
<br />2014年买入47笔, 卖出85笔, 总交易132笔, 总交易金额大约130万. 5月持仓最高约48万, 年末持仓最低约21万.
全年账面盈利增加约17万, 按照年初计划的100万资金投入, 算上国债逆回购和利息收入, 全年收益率大约21%. 
<br />2015年继续计划100万资金投入, 交易规则不变.
</p>

<h3><a name="2015">2015</a>总结</h3>
<p>2016年1月3日
<br />2015年总交易金额大约600万, 比<a href="#2014">2014</a>年多了4倍. 8月持仓最高约65万, 6月持仓最低约17万, 总体平均持仓比2014年略高.
全年账面盈利增加约6万, 按照年初计划的100万资金投入, 算上国债逆回购和利息收入, 全年收益率大约9%, 大幅低于2014年的21%.
<br />大约50%的交易金额是6-8月分级A贡献的, 今年的6万纯盈利也基本上来自于这段时间300万的分级A交易. 大家都说7月8日那种分级A集体跌停的机会百年难遇, 看来我这辈子再也碰不到了.
<br />上证指数站上5000点那天后跟老孙的几个朋友吃饭, 席间谈论的当然都是必破6124点的股票市场. 老孙听说我绝大部分人民币都放在银行买收益率5%的理财产品后, 大力推荐我购买当时折价已经在20%以上的分级A基金.
<br />基于对老孙学习精神的信任, 我赶紧恶补了一下. 发现折价20%以上的分级A的确是个好东西, 收益率比银行理财高, 风险却比银行理财低, 显然过去三年多以来我低估了人民币的无风险收益.
<br />考虑到分级A操作会比我的大型国企股票要频繁得多, 我在<a href="http://www.glsc.com.cn" target=_blank>国联证券</a>网上开了个0.025%, 最低5块交易费用的新帐户. 
本来是想联系中银国际降低佣金的, 无奈股市太火爆, 电话永远打不进去, 根本联系不上. 
<br /><font color=gray>中间是勤奋好学而且乐于分享的老孙. </font>
<br /><img src=../../groupphoto/customer/laosun.jpg alt="Li Jing, Sun Yanhong and me in central park, NYC." />
<br />炒股的好处不只限于分级A, 其实这一年多以来给我印象最深的是在雪球上看<?php EchoXueqieId('3037882447', '云蒙'); ?>来回在港股和A股之间买卖招商银行的股票, 哪边低就持有哪个. 用不到2百万的本金, 1年交易了几个亿, 稳稳赚了几百万.
这种锚定一个标的来回交易套利的模式值得学习. 
<br />Qualcomm收购CSR的现金在8月下旬到账后, 由于我的美股交易依旧毫无章法, 我其实有点发愁怎么处理这笔钱. 最省心的就是直接都买成Qualcomm股票, 然后接着放着不去管它.
反复考虑后, 我还是决定效仿云蒙. 锚定标普油气开采指数^SPSIOP的2个基金, 用我低交易费用的国联证券账户, 在A股的<?php EchoMyStockLink('SZ162411'); ?>和美股的<?php EchoMyStockLink('XOP'); ?>之间来回交易套利.
<br />其实我从2014年底就开始用当时手头不多的美元尝试抄底原油和相关股票的ETF, 碰到的还是老问题, 抄底的时候总抄在半山腰, 涨一点就忍不住卖光了. 希望通过套利交易能够克服我的持仓恐惧症.
<br />华宝油气虽然跟踪的是美国的页岩油气公司股票, 但是它喜欢跟A股涨跌, 而且涨的时候往往会溢价, 而跌的时候总会折价. 开始我一直觉得是A股钱多人傻, 买卖的人根本不知道自己买卖的是什么标的. 
但是后来我进入了第二层境界考虑这个问题, 由于A股的涨跌直接影响大宗商品的价格, 华宝油气跟A股短期走势一致也是可以理解的.  
后来看到老孙在微信上炫耀他读高中的儿子暑假2个月用18万本金在分级基金上套利总共获利2.5万人民币. 我于是进入了<font color=teal>看山还是山 看水还是水</font>的第三层境界: A股市场钱多人傻, 可能的确是套利交易者生存的好地方.
<br />这一年大约40%的交易金额来自SZ162411和XOP的套利交易, 体现在全年收益上是华宝油气亏损5万.
不过经过2015年5个月的摸索, 又写了<a href="20150818cn.php">华宝油气净值</a>估算工具, 感觉自己终于找到了阿里巴巴山洞的开门密码, 记录一下目前仓位, 以便日后比较.
<br /><img src=../photo/20160101.jpg alt="Screen shot of my 2015 XOP and SZ162411 arbitrage data" />
<br />剩下10%的交易金额主要是我的大型国企中国国航, 中国石化, 中国联通和中国银行等交易, 受益于上证指数今年10%的上涨, 盈利5万左右.
<br />2016年计划继续100万的投入, 主要用于<a href="../../res/sz162411cn.php">华宝油气</a>和XOP的套利交易, 向云蒙学习, 继续加大交易量, 增加套利效率. 同时逐步放弃中国国航和中国联通等比H股贵太多的A股的交易.
<br /><font color=gray>This could be Heaven or this could be Hell -- California Hotel</font>
</p>

<h3>留得青山在 不怕没柴烧 - <a name="2016">2016</a>总结</h3>
<p>2017年1月1日
<br />2016年几乎每天都在交易, 交易金额多得我在5月份就放弃统计了. 高频交易的结局却很悲惨. 全年人民币赚了228321.46, 美元亏了37815.39, 总体亏损人民币34003.89, 全年收益率大约-2%.
<br />整个2016年只有2个交易日总体持仓盈亏是赚钱的. 由于持续的亏钱导致心理崩溃好几次, 而在每次心理崩溃后都会暴饮暴食, 之前3年没有发作痛风在2016年发作了好几次, 让人生更加黑暗无比.
<br />年初的时候美油CL跌破40美元大举买入3倍杠杆的UWTI抄底, 一路接飞刀接到30美元弹尽粮绝. 眼看它跌到26, 反弹到33, 换月升水近2美元后再次跌回26, 当时觉得美元要赔光了, 吓破胆子后, 再次反弹到33割肉, 留下31111.66美元的亏损.
然后的剧情是CL一路上涨, 最高差不多到了55美元. 而我是再也不敢交易3倍杠杆的东西了. 
<br />上半年美股跌得比较厉害, 原来用<?php EchoMyStockLink('SH'); ?>做空美股对冲华宝油气和XOP的多仓作用太小, 美股反弹后就开始了<?php EchoMyStockLink('VXX'); ?>的自杀之旅. 一开始运气好, 没2个月就碰上了英国脱欧, VXX一度获利6000多美元.
然后美股一路新高, 到了11月临近美国总体竞选前实在崩溃了, 不仅把之前赚了赔了回去, 割肉后还留下大约8000美元亏空. 
Trump当选后美股又开始涨, 不死心继续买VXX, 再次崩溃, 12月30号最后一个交易日再次彻底割肉, 留下总共16063.35美元的亏损. 发誓赌咒再不碰它了, 回归SH空美股对冲.
<br />写<a href="#2015">2015</a>总结时觉得最靠谱的华宝油气和XOP的套利交易, 全年下来也讽刺得很. 几乎每天都在交易, 目前0持仓. 看上去是人民币赚了144989.38, 美元赚了12026.69.
残酷的现实情况是, 如果在2015年结束的仓位上完全不交易, 则会赚228480人民币和17920美元. 套利一整年收获无数多巴胺, 却比持股不动少赚35%的真金白银.
<br /><img src=../photo/20170101.jpg alt="Screen shot of woody's 2016 XOP and SZ162411 arbitrage data" />
<br />伴随套利交易而来的好处是交易费用下降了, A股新开了万分之2佣金的华泰证券账户, 最近客户经理还把我的基金交易佣金又调低到了万分之一, 而且它家基金交易还没有最低5块的限制.
美股跟随云蒙新开了IB账户, 每股交易费用0.005美元, 最低1美元, 相当于最少收200股的交易费用.
同时总交易金额迅速增加, 多到我不胜其烦, 干脆结束了原来用Excel统计交易量的栏目. 
花在交易上的时间也是急剧增加, 已经让我相当怀疑这么做有没有必要了, 还是要尽可能简化交易模式, 避免盯盘. 另外要赶快把IB的API搞起来, 自动交易美股部分. 
<br />全年唯一得意之处, 是在美股中石化价格高于A股中国石化的阶段空<?php EchoMyStockLink('SNP'); ?>多<?php EchoMyStockLink('SH600028'); ?>, 套利赚了点小钱不说, SH600028的门票打中了一个新股<?php EchoMyStockLink('SH603060'); ?>, 赚了37219.01人民币.
<br />2017年继续打新, 继续华宝油气和XOP套利, 同时看能不能多发掘其它类似套利途径. 坚决不再交易美股期货相关的ETF和杠杆ETF. 
</p>

<h3>采菊东篱下 悠然见南山 - <a name="2017">2017</a>总结</h3>
<p>2017年12月30日
<br />说多了都是泪. 先上图记录一下.
<br /><img src=../photo/20180102.jpg alt="Screen shot of woody's 2017 stock profit data" />
<br />在跟寒号鸟一样喊了好几年<font color=gray>同是天涯沦落人走投无路来炒股</font>后, 2017年算是我最接近全职投资的一年.
全职不光意味着跟前些年一样整天没有别的鸟事可做, 还意味着今年所有的钱都放到股市中来赌博了. 虽然操了卖粉的心, 却连白菜钱都没有赚到.
美元人民币一起本金大约350万人民币, 一年下来只有16万人民币的利润, 不到5%的收益率, 放银行闭着眼睛买理财一样能拿这么多钱. 
<br />年初在<?php EchoXueqieId('3724438413', '爱吐槽的骑姐'); ?>的感召下弄了几个HA价格差不多的A股门票打新, 很快就跟去年一样人品爆棚中了一个新股<?php EchoMyStockLink('SH603089'); ?>赚了3万多.
紧接着所有的门票就在我的持股恐惧症下卖飞了, 从此跟A股成了路人, 愧对从去年开始一直督促我打新的人生导师<?php EchoXueqieId('5421738073', 'thanous'); ?>. 
<br />在鼓吹XOP和华宝油气跨市场套利2年多后, 今年终于靠<?php EchoXueqieId('6706948861', 'zzzzv'); ?>的不懈教诲克服了唐氏综合症的天生迟钝, 在6月份开始了申购套利, 9月份第一次尝试了赎回, 并且在12月开始了赎回套利.
全年靠这个套利增加了大约12万人民币和1.5万美元的利润, 折算成人民币一共约22万收益. 这点小钱虽然比不上<?php EchoXueqieId('2950181900', '没钱老板'); ?>赚得多, 
但是多半比一直坚持学习巴菲特持股不动的<?php EchoXueqieId('6900406005', '大熊宝宝--林某人'); ?>收益好.
<br />跟自己比较也有找到了圣杯的感觉, 一年买卖总交易额1100万美元的套利总算跑赢了从2年前一开始就持股不动.
<br /><img src=../photo/20180101.jpg alt="Screen shot of woody's 2017 XOP and SZ162411 arbitrage data" />
<br />申购套利要从华宝官网场外转场内, 其中要用到深圳席位号:
</p>
<ul>
  <li>广发 236300</li>
  <li>华泰 233200</li>
</ul>
<p>在开始搞申购和赎回后, 由于漫长的人民币等待周期, 美元一下子显得多了出来, 不甘寂寞的我在9月份尝试了<?php EchoMyStockLink('SINA'); ?>和<?php EchoMyStockLink('WB'); ?>的套利, 在我的均线亏钱大法下很快演变成了一场裸空SINA的噩梦.
冷眼旁观的zzzzv嘲笑我说: 见过空WB多SINA的, 也见过空SINA多WB的, 裸空WB的也有, 就是没见过裸空SINA的. 最后我空的SINA在一个半月后终于不赔钱退出, 再不敢自作聪明了.
<br />而空标普500的噩梦则持续了一整年, 贡献了我今年所有的亏损. 本来想在昨天最后一个交易日彻底清空止损的, 但是没有下手, 主要还是不知道止损后多出来的十多万美元拿来干什么好.
想想当初夸下了海口, 出去的美元就没有打算再回来, 总不能现在打自己的耳光换成人民币吧! 
<br />2017年只剩下明天最后一天, 让我最满意的是, 忍住今晚不吃, 看样子今年能成功避免痛风发作. 得意之余, 年终总结的题目便从<a href="#2016">2016</a>年的<font color=teal>留得青山在 不怕没柴烧</font>改成了<font color=teal>采菊东篱下 悠然见南山</font>.
2018年继续大隐隐于市的隐居生活, 早日止损空标普, 继续套利的圣杯, 争取净赚个10%回来, 有望首次结束多年来坐吃山空的窘境. 
</p>

<h3>行至水穷处 坐看云起时 - <a name="2018">2018</a>总结</h3>
<p>2019年1月1日
<br /><img src=../photo/stockscreens.jpg alt="Woody's 2018 stock trading computer screens" />
<br />3台电脑, 全年每天A股4小时加美股6.5小时的全职交易, 光在IB上的买入和卖出总金额就都分别超过了1000万美元. 结果2018最终以亏近1万人民币结束.
<br />延续<a href="#2016">2016</a>和<a href="#2017">2017</a>每年一个的打新运气, 今年继续中了一个新股<?php EchoMyStockLink('SZ300748'); ?>. 不过收益大为缩水, 不到1万块.
<br />在美股中石化价格高于A股价格时空SNP多SH600028的交易策略一共出现了3次交易机会, 陆续加起来赚了几千块. 结果年底时一贯认为最安全的打新门票SH600028踩到雷, 2万股持仓2天一下子跌去一万多, 全年下来在中石化上总体倒还亏钱了.
<br />亏钱的东西当然远不止中石化, 6月下旬上证跌破2900后我巴菲特附体开始抄底沪深300, A股市场买<?php EchoMyStockLink('SH510300'); ?>, 美股市场买<?php EchoMyStockLink('ASHR'); ?>. 
一路抄底下来, 加起来已经有60多万人民币的持仓, 亏掉了快5万的本钱. 原本想象中的SH510300和ASHR跨市场套利则几乎没有什么收获, 估计炒ASHR的都是跟A50期货套利老韭菜, 面对这样的对手盘是没赚钱机会的.
<br />倒是采用天灵盖均线大法实现沪深300增强的操作总时不时有赚钱机会. 除了SH600028外, 其它的几个门票SZ000069, <?php EchoMyStockLink('SH600104'); ?>, SH600377和SH600600都或多或少赚了点钱, 多少弥补了一些沪深300的损失.
A股同涨同跌的特点多少年都没有变过, 不过我想随着市场上的中外大型联合收割机越来越多, 这种割韭菜的好日子以后也不会太长久了.
<br />当初让我有信心走向职业炒股的圣杯: 华宝油气和XOP的跨市场套利, 在这一年中总体亏了2万人民币. 年初时对圣杯期待过高, 持有了过多的华宝油气的同时空了过多的XOP, 结果在XOP第一次冲向45美元的过程中我的IB账户就爆仓了.
我之前经常嘲笑只用一个手机屏幕炒股的<?php EchoXueqieId('1620894332', '杭州大空头'); ?>没搞明白赌场规则就下场了, 在我亲历爆仓后才发现自己是五十步笑一百步, 其实我也没搞清楚IB的保证金规则!
<br />因为不了解赌场规则亏钱的事情还出现了一次, 2月5日盘后VIX恐慌指数暴涨100%, 让过去几年一直稳定赚钱的空VIX基金瞬间爆仓. 
当我看到<?php EchoMyStockLink('SVXY'); ?>盘后价格从70多直落到18时, 完全没有意识到是爆仓, 还以为是市场对第二天过度恐慌了. 依我长期空美股的经验, 我用401K账户中仅剩的一点现金咬牙买了100股抄底.
第2天清算完后, SVXY直接跌到了12块以下. 等到现在年底一看, 亏损比例已经超过40%, 接近1000美元就这么交了学费. 这次教训也进一步加强了我不做盘前盘后交易的决心, 一定不能在错误的时间跟错误的对手进行错误的交易!
<br />唯一赚钱的是我的屎SH, 全年减亏了大约7000美元, 目前还累计亏损接近16000美元. 对它回本我已经不做指望, 只求割肉减亏了.
<br />由于明显的用眼过度, 这是视力急剧下降的一年. 读了那么多年书一直到硕士毕业都没有近视, 而现在我已经在认真考虑去买人生第一副眼镜了. 
由于前10个月中年度赚钱的天数寥寥无几, 我的心态也越来越不好, 2017一整年没有发作的痛风终于在8月中旬的时候再次来临, 让我再一次感受到了死亡的阴影.
<br />这几年虽然没有赚到钱, 但是至少练就了不少少亏钱的本领. 展望2019, 我还是乐观的. 还是延续去年老的期望, 靠天灵盖均线大法做跨市场套利赚10%, 结束多年来坐吃山空的窘境.
<br /><img src=../photo/20190101.png alt="Screen shot of woody's 2018 stock profit data" />
</p>

<h3>人生如逆旅 我亦是行人 - <a name="2019">2019</a>总结</h3>
<p>2020年1月1日
<br />2019年全年盈利大约10万人民币, 收益率大约3%, 全仓投入的连续第4年没有达到10%收益率的目标, 失败率100%.
<br />其实本来在2月份的时候我已经做到了大约<font color=teal>7%</font>的收益, 当时<?php EchoXueqieId('5956716730', 'ALittlebird'); ?>就劝我刀枪入库马放南山, 剩下的10个月买银行理财, 就可以历史上第一次完成10%的年度目标了. 可惜我没有听如此睿智的建议.
<br />全年总交易金额比2018年下降了大约15%. 其实总体交易频率是略增的, 但是因为交易策略基本上没有大的变化, XOP的平均价格却比2018年低了一大截, 所以导致了总交易金额的下降. 
<br />以下是看图说话的细节, 可以跟<a href="#2018">2018</a>年总结对照阅读: 
<br /><img src=../photo/20200101.jpg alt="Screen shot of woody's 2019 stock profit data" />
</p>
<ul>
  <li>@ADRH分组对应2018年的CHU分组. 因为2019年取消了A股中国联通跟港股和美股的对照页面, 所以挪到了这里.
      <a href="#2016">2016</a>年初为了抄底油价割肉了CHU, 后来一直没有买回来, 随着港股一直跌, 跌到当年割肉价之下后我又手痒了, 开始均线大法逐步买回. 
      后来因为IB美元吃紧, 又开了港股通, 从深股通交易港股联通<?php EchoMyStockLink('00762'); ?>. 总体没有减亏多少, 不过第一次体验了世界第一贪心的港交所双向印花税.</li>
  <li>@LOTTERY彩票分组加入了2019年新中的2个新股<?php EchoMyStockLink('SH601512'); ?>和<?php EchoMyStockLink('SH688009'); ?>, 虽然中彩票的数量比前3年翻倍了, 但是收益却最少, 2个加起来不到1万块.</li> 
  <li>@MISTAKE分组集中了过去4年的错误操作, 2019年割肉了SVXY, 略微减亏一点点. 下决心再也不碰VIX的衍生品.</li>
  <li>@TICKET门票分组目前只剩下了一年跌了6%的上汽SH600104, 其它门票都已经绝尘而去. 这也体现了我的天灵盖均线大法的致命弱点, 拿不住赚钱的牛股, 长期持有的都是赔钱货. 
      不过得益于A股普涨, 打新门票分组这一年还是贡献了4万人民币的收益.</li>
  <li>SH510300沪深300分组已经全部清仓. 主要是为了腾出人民币做极其占用资金的华宝油气赎回套利. 这一年在SH510300和ASHR上的交易一共盈利了快12万人民币, 跟2018年底的持仓比, 倒是刚好跟上了沪深300指数的涨幅.</li> 
  <li>SH510900分组这一年没有交易.</li>
  <li>SH513500分组目前是我第一重仓, 包括600股SPY空单和2900股SH多单, 总共做空了26万美元的标普. 相比2018年底不到5万美元的SH来说增加了5倍多的仓位. 
      这一年加入<?php EchoMyStockLink('SPY'); ?>空单, 主要是不愿意自己手头的SH总被坏人做空吃我的杠杆损耗, 也不愿意总给IRS交10%的SH分红税. SH这种东西居然每个季度拿本金定期分红, 我只能说美帝太能收割全世界了. 
      标普2019年涨了30%, 我这第一重仓亏损了3.1万美元.</li>
  <li>SH518880分组2019年没有交易.</li>
  <li>SNP分组在2019年中石化第2次分红期间从SH600028把仓位都挪到SNP避免分红税后, 因为SNP一路下跌就一直没有机会再挪回来, 让我深刻体会到了什么叫股市三大幻觉: 美股要跌, A股要涨, 港股便宜!
      作为打新门票的一部分, 中石化这一年总体贡献了大约2万人民币的利润.</li> 
  <li>SZ162411分组是我交易的主战场. 2018年底XOP和华宝油气总持仓接近14万美元, XOP这一年跌了10%, 我的仓位随着天灵盖均线大法增加到了目前的25万美元, 是第2重仓. 得益于持续不断的溢价折价套利交易, 2019年这个分组盈利1.7万美元.</li> 
</ul>
<p><font color=gray>You can check out any time you like, but you can never leave. -- California Hotel</font>
</p>

<h3>坐观垂钓者 徒有羡鱼情 - <a name="2020">2020</a>年交易总结</h3>
<p>2021年1月2日
<br />自从使用自己写的<?php EchoWoodyPortfolioLink(); ?>网页统计多个美股和A股账户总体情况以来, 按年终美元和港币都转换成人民币的统一方式, <a href="#2016">2016</a>年亏了3万人民币, <a href="#2017">2017</a>年赚了16万, <a href="#2018">2018</a>年亏了1万, <a href="#2019">2019</a>年赚了10万. 
<br />2020年总体折算下来亏了21万人民币, 沿用前些年按350万本金计算收益的传统, 全年亏损了6%. 看似波澜不惊的背后, 其实是惊涛骇浪. 
<br />2020年全年基本上都在亏钱状态. 3月份最多的时候亏了150万, 远远超出了之前2016年最多不到70万的亏损. 
接下来的反弹中, 曾经在6月初减少到只亏不到30万. 不过好景不长, 到7月底时已经整整亏了70万, 8月减亏了几万后, 9月底时又整整亏了90万, 10月底时亏损则已经超过了100万. 11月奇迹般减亏70多万, 然而奇迹并没有在12月延续. 
<br />在2016年油价V型快速反弹的误导下, 3月份其实并不是我最恐慌的时候, 当时只是小心翼翼的维持着盈透账户美元不爆仓的底线. 
然而, 在10月底盈透账户再度面临爆仓的时候, 我是真正的束手无策, 甚至连像3月份时那样去找人换美元的勇气都没了. 还好, 上帝终于派来了蓝色小药丸公司的疫苗来救命. 
<br /><img src=../photo/bluelittlepill.jpg alt="Can not find my little blue pill" />
<br />在不断的爆仓阴影笼罩下, 2020年的总体交易都是缩手缩脚, 全年交易额比2019和2018年都低了不少, 盈透交易额已经不到2018年的70%, 买卖的美元港币人民币折算总金额已经跌到了不到2亿人民币. 
<br />以下是按股票分组看图说话的流水账. 
<br /><img src=../photo/20210102.jpg alt="Screen shot of woody's 2020 stock profit data" />
</p>
<ul>
  <li>@ADRH -1 面对全球疫情, 美股和A股都有人救, 只有港股没有人搭理. 00762全年下跌了37%, 我左侧交易在港股通和美股市场都是越跌越买, 最终年底总仓位是年初的400%, 到了14万人民币, 总体多亏损了1万多人民币.</li> 
  <li>@LOTTERY +8 2020年是新股大年, 一共中了4个新股, 在此彩票分组增加了8万利润. 无论是新股个数还是利润都直追前4年的5个新股和9万利润的总和.</li>
  <li>@MISTAKE +2 该分组包括的是前几年美股原油期货ETF和VIX期货ETF等错误交易, 在2020年无交易. 盈透账户中美元一直濒临爆仓拯救了我, 避免了在3月份原油暴跌时再度买入USO, 否则后果真是不堪设想. 
      虽然没有交易, 但是因为2020年人民币升值, 而这个分组之前亏的又都是美元, 最后换算成人民币, 少亏了2万!</li>
  <li>@OILPAIR +0 该分组是2020年新建, 也许写完这个总结后就会把它合并到@MISTAKE分组中, 去跟其中的SINA/WB配对交易为伴了, 因为这里包括的也是两个不成功的配对交易. 
      轮动交易<a href="../../res/sz162719cn.php">广发石油</a>和XOP的交易从6月19日持续到了8月14日, 然后在9月17到21日又投机搞了一次, 整整3个月时间一直过得很充实, 只是没有赚到钱. 分析了充实而不赚钱的两点原因, 一是人民币对美元持续升值, 二是对冲不精确. 
      另外一个在华宝油气和XOP的季度调仓时多XOP空<?php EchoMyStockLink('RRC'); ?>的配对交易则是完全踩错了点, 不过如果日后还有这种机会, 还是可以在踩准点的前提下再来一次的. 意识到了自己的错误后把RRC空单平仓了, 侥幸没有亏钱.</li> 
  <li>@OILQDII +5 该分组也是2020年新建, 我也有写完总结后把它合并到@MISTAKE分组中去跟USO和UWT为伍的冲动. 虽然这个分组在2020年赚了接近5万人民币, 但是赚钱的方式却是错误的. 
      而且估计以后也没有类似机会了, 预期国内监管层会闷杀全部原油期货QDII基金, 跟干掉分级基金一样. 
      说了无数次的大妈救命之恩是双重的, 一方面是大妈们勇于场内溢价接盘, 另外一方面, 场内高溢价吸引了天量的套利资金, 让原本流动性不好的原油QDII基金单日规模翻倍, 导致基金公司外汇资金跟不上建仓, 无意中躲过了3月份原油暴跌最厉害的那几天.</li> 
  <li>@TICKET +3 2020年彩票门票分组只用天灵盖均线大法操作了SH600104和SZ000069, 增加了3万人民币利润. 持仓金额基本持平. </li>
  <li>SH510300 -0 该分组在2020年只有8笔SH510300的交易和4笔ASHR的交易, 虽然在2019年的基础上人民币和美元都各自多赚了一点点, 但是总体折算成人民币的收益比2019年反而减少了, 这当然是因为人民币大幅升值的原因.</li> 
  <li>SH510900 0 该分组是2016年进行的固定网格交易测试, 从2017到2020年都没有再碰过.</li>
  <li>SH513500 +23 该分组从2019年的第一重仓到目前全部清仓, 标志着我坚持多年空标普多XOP策略的彻底破产. 从此不再当巴菲特的对手盘, 让我一下子倍感轻松. 
      在2020年3月9日割肉空标普500的仓位实属无奈, 因为当天我的盈透净值跌到了11万美元之下, 按规则不能保持4倍杠杆, 只能主动平仓把杠杆降到2倍之内. 事实上, 事后有人告诉我盈透的降杠杆不是马上执行的, 而10月底到11月初我的盈透净值再次跌到了11万美元之下, 的确验证了这个说法, 只是不知道到底会宽限多久. 
      2020年SPY上涨了18%, 这个分组却减亏了23万人民币, 实在是可喜可贺.</li>
  <li>SH518880 0 此时我已经不记得为什么自己会在2016年底到2017年初交易13笔SH518880了, 反正从那以后就没有再碰黄金.</li> 
  <li>SNP -4 该分组情况跟前面@ADRH类似, 00386在2020年下跌了19%, 我勇敢的越跌越买, 此刻仓位是一年前300%, 持仓已经折合53万人民币, 是第2重仓. 全年亏了折合4万人民币.</li> 
  <li>SZ160416 +3 该分组也是2020年新建, 包括2部分交易. 一部分是1月初伊朗将军被杀, 导致<a href="../../res/sz160416cn.php">石油基金</a>连续两天场内份额翻倍, 我手痒之下尝试了它跟<?php EchoMyStockLink('IXC'); ?>的跨市场套利, 后因为套利者互相踩踏和对冲不精确, 很难受的不亏钱退出了. 
      另外一部分是开始于9月份绝望的不要怂就是干抄底, 用错误的方法贡献了3万人民币的利润.</li>
  <li>SZ162411 -63 这里是我的主战场. XOP在2020年下跌了36%, 我在这一年中美元人民币总共亏了折合63万人民币. 表面上看总持仓从一年前的172万人民币降到了如今的155万, 其实是拼死加仓了46万. 
      华宝油气这一年不是连续溢价就是连续折价, 把十多万账户的套利者忙了个团团转. 每天都觉得自己在赚钱的感觉的确特别好, 除了在年末算总账的时候.</li>
  <li>SZ162719 +2 该分组也是今年新建, 幸好我今年换了个新的大屏幕一体机, 不然在小笔记本上完整的把持仓盈亏截图都难.
      主要交易是在9月份跟SZ160416一起绝望抄底, 然后没多久又怂了, 改为用<?php EchoMyStockLink('IEO'); ?>精准对冲后, 一直做折价赎回套利延续至今. 贡献了接近2万人民币的利润.</li> 
</ul>
<p>疫情终会过去, 也许2020年多亏点并不是坏处, 这样2021年我就有更有希望首次完成年度盈利10%的目标了. 2021年是背水一战, 再赚不到钱, 真的就只能去找工作, 因此标题用的是自荐求工作的两句诗. 
<br /><font color=gray>歌女的歌, 舞者的舞, 剑客的剑, 文人的笔, 英雄的斗志, 只要是不死, 就不能放弃. -- 英雄无泪</font>
</p>

</div>
                                  
<?php _LayoutBottom(); ?>

</body>
</html>
